__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
in_age (InputLayer)             (None, None, 2)      0                                            
__________________________________________________________________________________________________
in_bio (InputLayer)             (None, None, 7)      0                                            
__________________________________________________________________________________________________
in_fielding_position (InputLaye (None, None, 2)      0                                            
__________________________________________________________________________________________________
in_out_fielding_position (Input (None, None, 12)     0                                            
__________________________________________________________________________________________________
in_out_league_offense (InputLay (None, None, 9)      0                                            
__________________________________________________________________________________________________
in_out_park_factors (InputLayer (None, None, 8)      0                                            
__________________________________________________________________________________________________
in_out_plate_discipline (InputL (None, None, 8)      0                                            
__________________________________________________________________________________________________
in_out_running (InputLayer)     (None, None, 18)     0                                            
__________________________________________________________________________________________________
in_out_saber (InputLayer)       (None, None, 14)     0                                            
__________________________________________________________________________________________________
in_out_stats_extended (InputLay (None, None, 36)     0                                            
__________________________________________________________________________________________________
in_park_factors (InputLayer)    (None, None, 8)      0                                            
__________________________________________________________________________________________________
masked_in_age (Masking)         (None, None, 2)      0           in_age[0][0]                     
__________________________________________________________________________________________________
masked_in_bio (Masking)         (None, None, 7)      0           in_bio[0][0]                     
__________________________________________________________________________________________________
masked_in_fielding_position (Ma (None, None, 2)      0           in_fielding_position[0][0]       
__________________________________________________________________________________________________
masked_in_out_fielding_position (None, None, 12)     0           in_out_fielding_position[0][0]   
__________________________________________________________________________________________________
masked_in_out_league_offense (M (None, None, 9)      0           in_out_league_offense[0][0]      
__________________________________________________________________________________________________
masked_in_out_park_factors (Mas (None, None, 8)      0           in_out_park_factors[0][0]        
__________________________________________________________________________________________________
masked_in_out_plate_discipline  (None, None, 8)      0           in_out_plate_discipline[0][0]    
__________________________________________________________________________________________________
masked_in_out_running (Masking) (None, None, 18)     0           in_out_running[0][0]             
__________________________________________________________________________________________________
masked_in_out_saber (Masking)   (None, None, 14)     0           in_out_saber[0][0]               
__________________________________________________________________________________________________
masked_in_out_stats_extended (M (None, None, 36)     0           in_out_stats_extended[0][0]      
__________________________________________________________________________________________________
masked_in_park_factors (Masking (None, None, 8)      0           in_park_factors[0][0]            
__________________________________________________________________________________________________
time_distributed_5 (TimeDistrib (None, None, 1)      0           masked_in_age[0][0]              
__________________________________________________________________________________________________
time_distributed_3 (TimeDistrib (None, None, 6)      0           masked_in_bio[0][0]              
__________________________________________________________________________________________________
time_distributed_8 (TimeDistrib (None, None, 1)      0           masked_in_fielding_position[0][0]
__________________________________________________________________________________________________
time_distributed_4 (TimeDistrib (None, None, 11)     0           masked_in_out_fielding_position[0
__________________________________________________________________________________________________
time_distributed_1 (TimeDistrib (None, None, 8)      0           masked_in_out_league_offense[0][0
__________________________________________________________________________________________________
time_distributed_11 (TimeDistri (None, None, 7)      0           masked_in_out_park_factors[0][0] 
__________________________________________________________________________________________________
time_distributed_2 (TimeDistrib (None, None, 7)      0           masked_in_out_plate_discipline[0]
__________________________________________________________________________________________________
time_distributed_10 (TimeDistri (None, None, 17)     0           masked_in_out_running[0][0]      
__________________________________________________________________________________________________
time_distributed_9 (TimeDistrib (None, None, 13)     0           masked_in_out_saber[0][0]        
__________________________________________________________________________________________________
time_distributed_6 (TimeDistrib (None, None, 35)     0           masked_in_out_stats_extended[0][0
__________________________________________________________________________________________________
time_distributed_7 (TimeDistrib (None, None, 7)      0           masked_in_park_factors[0][0]     
__________________________________________________________________________________________________
norm_in_age (BatchNormalization (None, None, 1)      4           time_distributed_5[0][0]         
__________________________________________________________________________________________________
norm_in_bio (BatchNormalization (None, None, 6)      24          time_distributed_3[0][0]         
__________________________________________________________________________________________________
norm_in_fielding_position (Batc (None, None, 1)      4           time_distributed_8[0][0]         
__________________________________________________________________________________________________
norm_in_out_fielding_position ( (None, None, 11)     44          time_distributed_4[0][0]         
__________________________________________________________________________________________________
norm_in_out_league_offense (Bat (None, None, 8)      32          time_distributed_1[0][0]         
__________________________________________________________________________________________________
norm_in_out_park_factors (Batch (None, None, 7)      28          time_distributed_11[0][0]        
__________________________________________________________________________________________________
norm_in_out_plate_discipline (B (None, None, 7)      28          time_distributed_2[0][0]         
__________________________________________________________________________________________________2018-02-07 21:18:35.486701: I tensorflow/core/platform/cpu_feature_guard.cc:137] Your CPU supports instructions that this TensorFlow binary was not compiled to use: SSE4.1 SSE4.2 AVX AVX2 FMA
2018-02-07 21:18:42.136324: I tensorflow/core/common_runtime/gpu/gpu_device.cc:1105] Found device 0 with properties: 
name: Tesla K80 major: 3 minor: 7 memoryClockRate(GHz): 0.8235
pciBusID: eca0:00:00.0
totalMemory: 11.17GiB freeMemory: 11.10GiB
2018-02-07 21:18:42.136372: I tensorflow/core/common_runtime/gpu/gpu_device.cc:1195] Creating TensorFlow device (/device:GPU:0) -> (device: 0, name: Tesla K80, pci bus id: eca0:00:00.0, compute capability: 3.7)

norm_in_out_running (BatchNorma (None, None, 17)     68          time_distributed_10[0][0]        
__________________________________________________________________________________________________
norm_in_out_saber (BatchNormali (None, None, 13)     52          time_distributed_9[0][0]         
__________________________________________________________________________________________________
norm_in_out_stats_extended (Bat (None, None, 35)     140         time_distributed_6[0][0]         
__________________________________________________________________________________________________
norm_in_park_factors (BatchNorm (None, None, 7)      28          time_distributed_7[0][0]         
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, None, 113)    0           norm_in_age[0][0]                
                                                                 norm_in_bio[0][0]                
                                                                 norm_in_fielding_position[0][0]  
                                                                 norm_in_out_fielding_position[0][
                                                                 norm_in_out_league_offense[0][0] 
                                                                 norm_in_out_park_factors[0][0]   
                                                                 norm_in_out_plate_discipline[0][0
                                                                 norm_in_out_running[0][0]        
                                                                 norm_in_out_saber[0][0]          
                                                                 norm_in_out_stats_extended[0][0] 
                                                                 norm_in_park_factors[0][0]       
__________________________________________________________________________________________________
gru_1 (GRU)                     (None, None, 113)    76953       concatenate_1[0][0]              
__________________________________________________________________________________________________
gru_2 (GRU)                     (None, None, 113)    76953       gru_1[0][0]                      
__________________________________________________________________________________________________
mv_out_stats (TimeDistributed)  (None, None, 5)      4560        gru_2[0][0]                      
__________________________________________________________________________________________________
mv_out_counts (TimeDistributed) (None, None, 3)      2736        gru_2[0][0]                      
__________________________________________________________________________________________________
mv_out_mean_covariance (TimeDis (None, None, 72)     65664       gru_2[0][0]                      
__________________________________________________________________________________________________
mv_out_fielding_position (TimeD (None, None, 11)     10032       gru_2[0][0]                      
__________________________________________________________________________________________________
out_stats (Activation)          (None, None, 5)      0           mv_out_stats[0][0]               
__________________________________________________________________________________________________
out_counts (Activation)         (None, None, 3)      0           mv_out_counts[0][0]              
__________________________________________________________________________________________________
out_mean_covariance (Activation (None, None, 72)     0           mv_out_mean_covariance[0][0]     
__________________________________________________________________________________________________
out_fielding_position (Activati (None, None, 11)     0           mv_out_fielding_position[0][0]   
==================================================================================================
Total params: 237,350
Trainable params: 237,124
Non-trainable params: 226
__________________________________________________________________________________________________
Train on 5620 samples, validate on 1359 samples
Epoch 1/1000

Epoch 00001: val_loss improved from inf to 20.37857, saving model to models/bc/shift2/max2014/simple-rnn/6.h5
 - 15s - loss: 21.7852 - out_stats_loss: 8.2863 - out_counts_loss: 3.7782 - out_mean_covariance_loss: 104.2487 - out_fielding_position_loss: 4.5083 - val_loss: 20.3786 - val_out_stats_loss: 7.8676 - val_out_counts_loss: 3.2245 - val_out_mean_covariance_loss: 99.6416 - val_out_fielding_position_loss: 4.3044
Epoch 2/1000

Epoch 00002: val_loss improved from 20.37857 to 17.73479, saving model to models/bc/shift2/max2014/simple-rnn/6.h5
 - 5s - loss: 18.8102 - out_stats_loss: 7.1416 - out_counts_loss: 2.9363 - out_mean_covariance_loss: 92.4137 - out_fielding_position_loss: 4.1116 - val_loss: 17.7348 - val_out_stats_loss: 6.7114 - val_out_counts_loss: 2.6757 - val_out_mean_covariance_loss: 87.4778 - val_out_fielding_position_loss: 3.9738
Epoch 3/1000

Epoch 00003: val_loss improved from 17.73479 to 16.13737, saving model to models/bc/shift2/max2014/simple-rnn/6.h5
 - 5s - loss: 16.7264 - out_stats_loss: 6.2178 - out_counts_loss: 2.6199 - out_mean_covariance_loss: 81.5385 - out_fielding_position_loss: 3.8118 - val_loss: 16.1374 - val_out_stats_loss: 6.0801 - val_out_counts_loss: 2.4606 - val_out_mean_covariance_loss: 78.3593 - val_out_fielding_position_loss: 3.6787
Epoch 4/1000

Epoch 00004: val_loss improved from 16.13737 to 15.32726, saving model to models/bc/shift2/max2014/simple-rnn/6.h5
 - 5s - loss: 15.6591 - out_stats_loss: 5.8490 - out_counts_loss: 2.4745 - out_mean_covariance_loss: 75.5399 - out_fielding_position_loss: 3.5586 - val_loss: 15.3273 - val_out_stats_loss: 5.8379 - val_out_counts_loss: 2.3557 - val_out_mean_covariance_loss: 74.0090 - val_out_fielding_position_loss: 3.4332
Epoch 5/1000

Epoch 00005: val_loss improved from 15.32726 to 14.81432, saving model to models/bc/shift2/max2014/simple-rnn/6.h5
 - 5s - loss: 14.9832 - out_stats_loss: 5.6606 - out_counts_loss: 2.3871 - out_mean_covariance_loss: 72.1020 - out_fielding_position_loss: 3.3304 - val_loss: 14.8143 - val_out_stats_loss: 5.7031 - val_out_counts_loss: 2.3120 - val_out_mean_covariance_loss: 71.3330 - val_out_fielding_position_loss: 3.2326
Epoch 6/1000

Epoch 00006: val_loss improved from 14.81432 to 14.43191, saving model to models/bc/shift2/max2014/simple-rnn/6.h5
 - 5s - loss: 14.5523 - out_stats_loss: 5.5504 - out_counts_loss: 2.3484 - out_mean_covariance_loss: 70.0197 - out_fielding_position_loss: 3.1525 - val_loss: 14.4319 - val_out_stats_loss: 5.6107 - val_out_counts_loss: 2.2732 - val_out_mean_covariance_loss: 69.6906 - val_out_fielding_position_loss: 3.0635
Epoch 7/1000

Epoch 00007: val_loss improved from 14.43191 to 14.19136, saving model to models/bc/shift2/max2014/simple-rnn/6.h5
 - 5s - loss: 14.1650 - out_stats_loss: 5.4368 - out_counts_loss: 2.3170 - out_mean_covariance_loss: 68.1302 - out_fielding_position_loss: 3.0047 - val_loss: 14.1914 - val_out_stats_loss: 5.5753 - val_out_counts_loss: 2.2605 - val_out_mean_covariance_loss: 68.6640 - val_out_fielding_position_loss: 2.9224
Epoch 8/1000

Epoch 00008: val_loss improved from 14.19136 to 14.00029, saving model to models/bc/shift2/max2014/simple-rnn/6.h5
 - 5s - loss: 13.9551 - out_stats_loss: 5.4019 - out_counts_loss: 2.2919 - out_mean_covariance_loss: 67.3692 - out_fielding_position_loss: 2.8929 - val_loss: 14.0003 - val_out_stats_loss: 5.5067 - val_out_counts_loss: 2.2710 - val_out_mean_covariance_loss: 68.0461 - val_out_fielding_position_loss: 2.8203
Epoch 9/1000

Epoch 00009: val_loss improved from 14.00029 to 13.85981, saving model to models/bc/shift2/max2014/simple-rnn/6.h5
 - 5s - loss: 13.7891 - out_stats_loss: 5.3696 - out_counts_loss: 2.2840 - out_mean_covariance_loss: 66.9440 - out_fielding_position_loss: 2.7883 - val_loss: 13.8598 - val_out_stats_loss: 5.4998 - val_out_counts_loss: 2.2349 - val_out_mean_covariance_loss: 67.4338 - val_out_fielding_position_loss: 2.7534
Epoch 10/1000

Epoch 00010: val_loss improved from 13.85981 to 13.70666, saving model to models/bc/shift2/max2014/simple-rnn/6.h5
 - 5s - loss: 13.6694 - out_stats_loss: 5.3512 - out_counts_loss: 2.2659 - out_mean_covariance_loss: 66.3696 - out_fielding_position_loss: 2.7337 - val_loss: 13.7067 - val_out_stats_loss: 5.4475 - val_out_counts_loss: 2.2255 - val_out_mean_covariance_loss: 66.9509 - val_out_fielding_position_loss: 2.6861
Epoch 11/1000

Epoch 00011: val_loss improved from 13.70666 to 13.65888, saving model to models/bc/shift2/max2014/simple-rnn/6.h5
 - 5s - loss: 13.4511 - out_stats_loss: 5.2736 - out_counts_loss: 2.2463 - out_mean_covariance_loss: 65.1861 - out_fielding_position_loss: 2.6719 - val_loss: 13.6589 - val_out_stats_loss: 5.4409 - val_out_counts_loss: 2.2298 - val_out_mean_covariance_loss: 66.7711 - val_out_fielding_position_loss: 2.6496
Epoch 12/1000

Epoch 00012: val_loss improved from 13.65888 to 13.55464, saving model to models/bc/shift2/max2014/simple-rnn/6.h5
 - 5s - loss: 13.4190 - out_stats_loss: 5.2850 - out_counts_loss: 2.2325 - out_mean_covariance_loss: 65.3055 - out_fielding_position_loss: 2.6363 - val_loss: 13.5546 - val_out_stats_loss: 5.4057 - val_out_counts_loss: 2.2155 - val_out_mean_covariance_loss: 66.3674 - val_out_fielding_position_loss: 2.6150
Epoch 13/1000

Epoch 00013: val_loss did not improve
 - 5s - loss: 13.3091 - out_stats_loss: 5.2467 - out_counts_loss: 2.2159 - out_mean_covariance_loss: 64.9101 - out_fielding_position_loss: 2.6010 - val_loss: 13.5728 - val_out_stats_loss: 5.4166 - val_out_counts_loss: 2.2543 - val_out_mean_covariance_loss: 66.3234 - val_out_fielding_position_loss: 2.5857
Epoch 14/1000

Epoch 00014: val_loss improved from 13.55464 to 13.44998, saving model to models/bc/shift2/max2014/simple-rnn/6.h5
 - 5s - loss: 13.2034 - out_stats_loss: 5.2148 - out_counts_loss: 2.1925 - out_mean_covariance_loss: 64.4396 - out_fielding_position_loss: 2.5741 - val_loss: 13.4500 - val_out_stats_loss: 5.3723 - val_out_counts_loss: 2.2136 - val_out_mean_covariance_loss: 65.9619 - val_out_fielding_position_loss: 2.5660
Epoch 15/1000

Epoch 00015: val_loss improved from 13.44998 to 13.40921, saving model to models/bc/shift2/max2014/simple-rnn/6.h5
 - 5s - loss: 13.0857 - out_stats_loss: 5.1741 - out_counts_loss: 2.1789 - out_mean_covariance_loss: 63.6155 - out_fielding_position_loss: 2.5520 - val_loss: 13.4092 - val_out_stats_loss: 5.3623 - val_out_counts_loss: 2.2038 - val_out_mean_covariance_loss: 65.7952 - val_out_fielding_position_loss: 2.5533
Epoch 16/1000

Epoch 00016: val_loss did not improve
 - 5s - loss: 13.1222 - out_stats_loss: 5.2072 - out_counts_loss: 2.1710 - out_mean_covariance_loss: 64.1633 - out_fielding_position_loss: 2.5358 - val_loss: 13.4229 - val_out_stats_loss: 5.3875 - val_out_counts_loss: 2.2094 - val_out_mean_covariance_loss: 65.7269 - val_out_fielding_position_loss: 2.5396
Epoch 17/1000

Epoch 00017: val_loss improved from 13.40921 to 13.33942, saving model to models/bc/shift2/max2014/simple-rnn/6.h5
 - 5s - loss: 13.0309 - out_stats_loss: 5.1837 - out_counts_loss: 2.1551 - out_mean_covariance_loss: 63.8719 - out_fielding_position_loss: 2.4985 - val_loss: 13.3394 - val_out_stats_loss: 5.3393 - val_out_counts_loss: 2.2026 - val_out_mean_covariance_loss: 65.4155 - val_out_fielding_position_loss: 2.5267
Epoch 18/1000

Epoch 00018: val_loss improved from 13.33942 to 13.33106, saving model to models/bc/shift2/max2014/simple-rnn/6.h5
 - 5s - loss: 13.0068 - out_stats_loss: 5.1817 - out_counts_loss: 2.1402 - out_mean_covariance_loss: 63.9866 - out_fielding_position_loss: 2.4855 - val_loss: 13.3311 - val_out_stats_loss: 5.3383 - val_out_counts_loss: 2.2092 - val_out_mean_covariance_loss: 65.3870 - val_out_fielding_position_loss: 2.5142
Epoch 19/1000

Epoch 00019: val_loss did not improve
 - 5s - loss: 12.8578 - out_stats_loss: 5.1210 - out_counts_loss: 2.1277 - out_mean_covariance_loss: 62.9088 - out_fielding_position_loss: 2.4636 - val_loss: 13.3346 - val_out_stats_loss: 5.3392 - val_out_counts_loss: 2.2246 - val_out_mean_covariance_loss: 65.1196 - val_out_fielding_position_loss: 2.5147
Epoch 20/1000

Epoch 00020: val_loss improved from 13.33106 to 13.26820, saving model to models/bc/shift2/max2014/simple-rnn/6.h5
 - 5s - loss: 12.8791 - out_stats_loss: 5.1319 - out_counts_loss: 2.1259 - out_mean_covariance_loss: 63.1248 - out_fielding_position_loss: 2.4651 - val_loss: 13.2682 - val_out_stats_loss: 5.3213 - val_out_counts_loss: 2.2021 - val_out_mean_covariance_loss: 64.9193 - val_out_fielding_position_loss: 2.4989
Epoch 21/1000

Epoch 00021: val_loss did not improve
 - 4s - loss: 12.8261 - out_stats_loss: 5.1292 - out_counts_loss: 2.1019 - out_mean_covariance_loss: 63.2325 - out_fielding_position_loss: 2.4334 - val_loss: 13.2822 - val_out_stats_loss: 5.3396 - val_out_counts_loss: 2.2003 - val_out_mean_covariance_loss: 64.9639 - val_out_fielding_position_loss: 2.4941
Epoch 22/1000

Epoch 00022: val_loss improved from 13.26820 to 13.23482, saving model to models/bc/shift2/max2014/simple-rnn/6.h5
 - 5s - loss: 12.7550 - out_stats_loss: 5.1040 - out_counts_loss: 2.0963 - out_mean_covariance_loss: 62.5549 - out_fielding_position_loss: 2.4270 - val_loss: 13.2348 - val_out_stats_loss: 5.3071 - val_out_counts_loss: 2.2020 - val_out_mean_covariance_loss: 64.8251 - val_out_fielding_position_loss: 2.4845
Epoch 23/1000

Epoch 00023: val_loss improved from 13.23482 to 13.22148, saving model to models/bc/shift2/max2014/simple-rnn/6.h5
 - 5s - loss: 12.6585 - out_stats_loss: 5.0694 - out_counts_loss: 2.0741 - out_mean_covariance_loss: 62.0986 - out_fielding_position_loss: 2.4101 - val_loss: 13.2215 - val_out_stats_loss: 5.3079 - val_out_counts_loss: 2.1983 - val_out_mean_covariance_loss: 64.6719 - val_out_fielding_position_loss: 2.4816
Epoch 24/1000

Epoch 00024: val_loss improved from 13.22148 to 13.20038, saving model to models/bc/shift2/max2014/simple-rnn/6.h5
 - 5s - loss: 12.6546 - out_stats_loss: 5.0854 - out_counts_loss: 2.0569 - out_mean_covariance_loss: 62.2313 - out_fielding_position_loss: 2.4008 - val_loss: 13.2004 - val_out_stats_loss: 5.2953 - val_out_counts_loss: 2.2102 - val_out_mean_covariance_loss: 64.4424 - val_out_fielding_position_loss: 2.4728
Epoch 25/1000

Epoch 00025: val_loss did not improve
 - 4s - loss: 12.5673 - out_stats_loss: 5.0371 - out_counts_loss: 2.0421 - out_mean_covariance_loss: 61.8844 - out_fielding_position_loss: 2.3938 - val_loss: 13.2399 - val_out_stats_loss: 5.3082 - val_out_counts_loss: 2.2245 - val_out_mean_covariance_loss: 64.7550 - val_out_fielding_position_loss: 2.4695
Epoch 26/1000

Epoch 00026: val_loss improved from 13.20038 to 13.18427, saving model to models/bc/shift2/max2014/simple-rnn/6.h5
 - 5s - loss: 12.5778 - out_stats_loss: 5.0550 - out_counts_loss: 2.0364 - out_mean_covariance_loss: 62.0801 - out_fielding_position_loss: 2.3823 - val_loss: 13.1843 - val_out_stats_loss: 5.2947 - val_out_counts_loss: 2.2115 - val_out_mean_covariance_loss: 64.3231 - val_out_fielding_position_loss: 2.4619
Epoch 27/1000

Epoch 00027: val_loss did not improve
 - 4s - loss: 12.5010 - out_stats_loss: 5.0177 - out_counts_loss: 2.0383 - out_mean_covariance_loss: 61.2761 - out_fielding_position_loss: 2.3812 - val_loss: 13.1976 - val_out_stats_loss: 5.3011 - val_out_counts_loss: 2.2239 - val_out_mean_covariance_loss: 64.3288 - val_out_fielding_position_loss: 2.4562
Epoch 28/1000

Epoch 00028: val_loss improved from 13.18427 to 13.15674, saving model to models/bc/shift2/max2014/simple-rnn/6.h5
 - 5s - loss: 12.4484 - out_stats_loss: 5.0231 - out_counts_loss: 2.0081 - out_mean_covariance_loss: 61.2660 - out_fielding_position_loss: 2.3538 - val_loss: 13.1567 - val_out_stats_loss: 5.2801 - val_out_counts_loss: 2.2069 - val_out_mean_covariance_loss: 64.3245 - val_out_fielding_position_loss: 2.4535
Epoch 29/1000

Epoch 00029: val_loss did not improve
 - 5s - loss: 12.4170 - out_stats_loss: 5.0091 - out_counts_loss: 1.9967 - out_mean_covariance_loss: 61.3858 - out_fielding_position_loss: 2.3419 - val_loss: 13.1603 - val_out_stats_loss: 5.2894 - val_out_counts_loss: 2.2210 - val_out_mean_covariance_loss: 64.1226 - val_out_fielding_position_loss: 2.4438
Epoch 30/1000

Epoch 00030: val_loss did not improve
 - 4s - loss: 12.4160 - out_stats_loss: 5.0202 - out_counts_loss: 1.9954 - out_mean_covariance_loss: 61.2704 - out_fielding_position_loss: 2.3368 - val_loss: 13.2692 - val_out_stats_loss: 5.3203 - val_out_counts_loss: 2.2837 - val_out_mean_covariance_loss: 64.3705 - val_out_fielding_position_loss: 2.4467
Epoch 31/1000

Epoch 00031: val_loss improved from 13.15674 to 13.14441, saving model to models/bc/shift2/max2014/simple-rnn/6.h5
 - 5s - loss: 12.4576 - out_stats_loss: 5.0367 - out_counts_loss: 2.0159 - out_mean_covariance_loss: 61.6811 - out_fielding_position_loss: 2.3210 - val_loss: 13.1444 - val_out_stats_loss: 5.2915 - val_out_counts_loss: 2.2156 - val_out_mean_covariance_loss: 64.1317 - val_out_fielding_position_loss: 2.4308
Epoch 32/1000

Epoch 00032: val_loss improved from 13.14441 to 13.13982, saving model to models/bc/shift2/max2014/simple-rnn/6.h5
 - 5s - loss: 12.3189 - out_stats_loss: 4.9888 - out_counts_loss: 1.9828 - out_mean_covariance_loss: 60.9619 - out_fielding_position_loss: 2.2992 - val_loss: 13.1398 - val_out_stats_loss: 5.2854 - val_out_counts_loss: 2.2260 - val_out_mean_covariance_loss: 63.9644 - val_out_fielding_position_loss: 2.4302
Epoch 33/1000

Epoch 00033: val_loss improved from 13.13982 to 13.10521, saving model to models/bc/shift2/max2014/simple-rnn/6.h5
 - 5s - loss: 12.2604 - out_stats_loss: 4.9728 - out_counts_loss: 1.9639 - out_mean_covariance_loss: 60.6343 - out_fielding_position_loss: 2.2920 - val_loss: 13.1052 - val_out_stats_loss: 5.2721 - val_out_counts_loss: 2.2164 - val_out_mean_covariance_loss: 63.7742 - val_out_fielding_position_loss: 2.4280
Epoch 34/1000

Epoch 00034: val_loss improved from 13.10521 to 13.09511, saving model to models/bc/shift2/max2014/simple-rnn/6.h5
 - 5s - loss: 12.2371 - out_stats_loss: 4.9724 - out_counts_loss: 1.9430 - out_mean_covariance_loss: 60.7176 - out_fielding_position_loss: 2.2858 - val_loss: 13.0951 - val_out_stats_loss: 5.2698 - val_out_counts_loss: 2.2170 - val_out_mean_covariance_loss: 63.7703 - val_out_fielding_position_loss: 2.4198
Epoch 35/1000

Epoch 00035: val_loss did not improve
 - 5s - loss: 12.1582 - out_stats_loss: 4.9500 - out_counts_loss: 1.9158 - out_mean_covariance_loss: 60.4282 - out_fielding_position_loss: 2.2711 - val_loss: 13.1165 - val_out_stats_loss: 5.2811 - val_out_counts_loss: 2.2298 - val_out_mean_covariance_loss: 63.8351 - val_out_fielding_position_loss: 2.4138
Epoch 36/1000

Epoch 00036: val_loss did not improve
 - 4s - loss: 12.1501 - out_stats_loss: 4.9611 - out_counts_loss: 1.9075 - out_mean_covariance_loss: 60.4743 - out_fielding_position_loss: 2.2578 - val_loss: 13.1240 - val_out_stats_loss: 5.2911 - val_out_counts_loss: 2.2339 - val_out_mean_covariance_loss: 63.7927 - val_out_fielding_position_loss: 2.4094
Epoch 37/1000

Epoch 00037: val_loss did not improve
 - 5s - loss: 12.0867 - out_stats_loss: 4.9371 - out_counts_loss: 1.9091 - out_mean_covariance_loss: 59.9265 - out_fielding_position_loss: 2.2442 - val_loss: 13.1386 - val_out_stats_loss: 5.2919 - val_out_counts_loss: 2.2497 - val_out_mean_covariance_loss: 63.7995 - val_out_fielding_position_loss: 2.4069
Epoch 38/1000

Epoch 00038: val_loss did not improve
 - 4s - loss: 12.0310 - out_stats_loss: 4.9129 - out_counts_loss: 1.8916 - out_mean_covariance_loss: 59.7138 - out_fielding_position_loss: 2.2408 - val_loss: 13.1214 - val_out_stats_loss: 5.2864 - val_out_counts_loss: 2.2480 - val_out_mean_covariance_loss: 63.7150 - val_out_fielding_position_loss: 2.4013
Epoch 39/1000

Epoch 00039: val_loss improved from 13.09511 to 13.07114, saving model to models/bc/shift2/max2014/simple-rnn/6.h5
 - 5s - loss: 12.0259 - out_stats_loss: 4.9255 - out_counts_loss: 1.8774 - out_mean_covariance_loss: 59.9483 - out_fielding_position_loss: 2.2256 - val_loss: 13.0711 - val_out_stats_loss: 5.2703 - val_out_counts_loss: 2.2326 - val_out_mean_covariance_loss: 63.6037 - val_out_fielding_position_loss: 2.3880
Epoch 40/1000

Epoch 00040: val_loss did not improve
 - 5s - loss: 12.0281 - out_stats_loss: 4.9234 - out_counts_loss: 1.8912 - out_mean_covariance_loss: 59.8726 - out_fielding_position_loss: 2.2199 - val_loss: 13.1083 - val_out_stats_loss: 5.2808 - val_out_counts_loss: 2.2633 - val_out_mean_covariance_loss: 63.5487 - val_out_fielding_position_loss: 2.3868
Epoch 41/1000

Epoch 00041: val_loss did not improve
 - 5s - loss: 11.9497 - out_stats_loss: 4.9059 - out_counts_loss: 1.8575 - out_mean_covariance_loss: 59.8668 - out_fielding_position_loss: 2.1929 - val_loss: 13.0847 - val_out_stats_loss: 5.2809 - val_out_counts_loss: 2.2435 - val_out_mean_covariance_loss: 63.5732 - val_out_fielding_position_loss: 2.3816
Epoch 42/1000

Epoch 00042: val_loss improved from 13.07114 to 13.06674, saving model to models/bc/shift2/max2014/simple-rnn/6.h5
 - 5s - loss: 11.9525 - out_stats_loss: 4.9070 - out_counts_loss: 1.8524 - out_mean_covariance_loss: 59.9021 - out_fielding_position_loss: 2.1980 - val_loss: 13.0667 - val_out_stats_loss: 5.2737 - val_out_counts_loss: 2.2385 - val_out_mean_covariance_loss: 63.4845 - val_out_fielding_position_loss: 2.3803
Epoch 43/1000

Epoch 00043: val_loss improved from 13.06674 to 13.04519, saving model to models/bc/shift2/max2014/simple-rnn/6.h5
 - 5s - loss: 11.9648 - out_stats_loss: 4.9291 - out_counts_loss: 1.8562 - out_mean_covariance_loss: 59.9352 - out_fielding_position_loss: 2.1827 - val_loss: 13.0452 - val_out_stats_loss: 5.2701 - val_out_counts_loss: 2.2362 - val_out_mean_covariance_loss: 63.4179 - val_out_fielding_position_loss: 2.3679
Epoch 44/1000

Epoch 00044: val_loss did not improve
 - 5s - loss: 11.8548 - out_stats_loss: 4.8821 - out_counts_loss: 1.8280 - out_mean_covariance_loss: 59.3091 - out_fielding_position_loss: 2.1792 - val_loss: 13.0831 - val_out_stats_loss: 5.2881 - val_out_counts_loss: 2.2490 - val_out_mean_covariance_loss: 63.5671 - val_out_fielding_position_loss: 2.3676
Epoch 45/1000

Epoch 00045: val_loss did not improve
 - 5s - loss: 11.8152 - out_stats_loss: 4.8664 - out_counts_loss: 1.8203 - out_mean_covariance_loss: 59.1040 - out_fielding_position_loss: 2.1733 - val_loss: 13.0982 - val_out_stats_loss: 5.2913 - val_out_counts_loss: 2.2598 - val_out_mean_covariance_loss: 63.5456 - val_out_fielding_position_loss: 2.3698
Epoch 46/1000

Epoch 00046: val_loss did not improve
 - 5s - loss: 11.7872 - out_stats_loss: 4.8674 - out_counts_loss: 1.8237 - out_mean_covariance_loss: 58.9779 - out_fielding_position_loss: 2.1473 - val_loss: 13.1183 - val_out_stats_loss: 5.2878 - val_out_counts_loss: 2.2837 - val_out_mean_covariance_loss: 63.5728 - val_out_fielding_position_loss: 2.3682
Epoch 47/1000

Epoch 00047: val_loss did not improve
 - 5s - loss: 11.8180 - out_stats_loss: 4.8822 - out_counts_loss: 1.8199 - out_mean_covariance_loss: 59.3851 - out_fielding_position_loss: 2.1467 - val_loss: 13.0988 - val_out_stats_loss: 5.2846 - val_out_counts_loss: 2.2809 - val_out_mean_covariance_loss: 63.4819 - val_out_fielding_position_loss: 2.3592
Epoch 48/1000

Epoch 00048: val_loss did not improve
 - 5s - loss: 11.7101 - out_stats_loss: 4.8596 - out_counts_loss: 1.7997 - out_mean_covariance_loss: 58.5852 - out_fielding_position_loss: 2.1216 - val_loss: 13.0990 - val_out_stats_loss: 5.2923 - val_out_counts_loss: 2.2829 - val_out_mean_covariance_loss: 63.4273 - val_out_fielding_position_loss: 2.3525
Epoch 49/1000

Epoch 00049: val_loss did not improve
 - 5s - loss: 11.6701 - out_stats_loss: 4.8431 - out_counts_loss: 1.7801 - out_mean_covariance_loss: 58.4673 - out_fielding_position_loss: 2.1236 - val_loss: 13.1157 - val_out_stats_loss: 5.2925 - val_out_counts_loss: 2.2898 - val_out_mean_covariance_loss: 63.4403 - val_out_fielding_position_loss: 2.3614
Epoch 50/1000

Epoch 00050: val_loss did not improve
 - 5s - loss: 11.6829 - out_stats_loss: 4.8535 - out_counts_loss: 1.7744 - out_mean_covariance_loss: 58.7945 - out_fielding_position_loss: 2.1153 - val_loss: 13.1268 - val_out_stats_loss: 5.2927 - val_out_counts_loss: 2.3069 - val_out_mean_covariance_loss: 63.5660 - val_out_fielding_position_loss: 2.3489
Epoch 51/1000

Epoch 00051: val_loss did not improve
 - 4s - loss: 11.6872 - out_stats_loss: 4.8666 - out_counts_loss: 1.7853 - out_mean_covariance_loss: 58.7611 - out_fielding_position_loss: 2.0973 - val_loss: 13.1190 - val_out_stats_loss: 5.3074 - val_out_counts_loss: 2.3021 - val_out_mean_covariance_loss: 63.3417 - val_out_fielding_position_loss: 2.3425
Epoch 52/1000

Epoch 00052: val_loss did not improve
 - 5s - loss: 11.5853 - out_stats_loss: 4.8300 - out_counts_loss: 1.7413 - out_mean_covariance_loss: 58.2746 - out_fielding_position_loss: 2.1003 - val_loss: 13.1018 - val_out_stats_loss: 5.2874 - val_out_counts_loss: 2.3108 - val_out_mean_covariance_loss: 63.3538 - val_out_fielding_position_loss: 2.3359
Epoch 53/1000

Epoch 00053: val_loss did not improve
 - 4s - loss: 11.6284 - out_stats_loss: 4.8490 - out_counts_loss: 1.7458 - out_mean_covariance_loss: 58.8466 - out_fielding_position_loss: 2.0912 - val_loss: 13.1719 - val_out_stats_loss: 5.3229 - val_out_counts_loss: 2.3368 - val_out_mean_covariance_loss: 63.4642 - val_out_fielding_position_loss: 2.3390
Epoch 54/1000

Epoch 00054: val_loss did not improve
 - 5s - loss: 11.5296 - out_stats_loss: 4.8121 - out_counts_loss: 1.7456 - out_mean_covariance_loss: 58.1849 - out_fielding_position_loss: 2.0626 - val_loss: 13.0737 - val_out_stats_loss: 5.2770 - val_out_counts_loss: 2.3071 - val_out_mean_covariance_loss: 63.2737 - val_out_fielding_position_loss: 2.3258
Epoch 55/1000

Epoch 00055: val_loss did not improve
 - 5s - loss: 11.4823 - out_stats_loss: 4.8036 - out_counts_loss: 1.7290 - out_mean_covariance_loss: 58.0071 - out_fielding_position_loss: 2.0494 - val_loss: 13.1005 - val_out_stats_loss: 5.2850 - val_out_counts_loss: 2.3184 - val_out_mean_covariance_loss: 63.3704 - val_out_fielding_position_loss: 2.3285
Epoch 56/1000

Epoch 00056: val_loss did not improve
 - 5s - loss: 11.4754 - out_stats_loss: 4.7995 - out_counts_loss: 1.7299 - out_mean_covariance_loss: 57.8670 - out_fielding_position_loss: 2.0527 - val_loss: 13.0980 - val_out_stats_loss: 5.2866 - val_out_counts_loss: 2.3191 - val_out_mean_covariance_loss: 63.3039 - val_out_fielding_position_loss: 2.3270
Epoch 57/1000

Epoch 00057: val_loss did not improve
 - 4s - loss: 11.4187 - out_stats_loss: 4.7849 - out_counts_loss: 1.7124 - out_mean_covariance_loss: 57.5786 - out_fielding_position_loss: 2.0424 - val_loss: 13.1663 - val_out_stats_loss: 5.3083 - val_out_counts_loss: 2.3615 - val_out_mean_covariance_loss: 63.3730 - val_out_fielding_position_loss: 2.3277
Epoch 58/1000

Epoch 00058: val_loss did not improve
 - 5s - loss: 11.4302 - out_stats_loss: 4.7857 - out_counts_loss: 1.7253 - out_mean_covariance_loss: 57.6880 - out_fielding_position_loss: 2.0348 - val_loss: 13.1193 - val_out_stats_loss: 5.2935 - val_out_counts_loss: 2.3458 - val_out_mean_covariance_loss: 63.3071 - val_out_fielding_position_loss: 2.3146
Epoch 59/1000

Epoch 00059: val_loss did not improve
 - 5s - loss: 11.3727 - out_stats_loss: 4.7653 - out_counts_loss: 1.7086 - out_mean_covariance_loss: 57.5032 - out_fielding_position_loss: 2.0236 - val_loss: 13.0862 - val_out_stats_loss: 5.2864 - val_out_counts_loss: 2.3236 - val_out_mean_covariance_loss: 63.3838 - val_out_fielding_position_loss: 2.3069
Epoch 60/1000

Epoch 00060: val_loss did not improve
 - 4s - loss: 11.4098 - out_stats_loss: 4.7949 - out_counts_loss: 1.7079 - out_mean_covariance_loss: 57.8010 - out_fielding_position_loss: 2.0170 - val_loss: 13.0980 - val_out_stats_loss: 5.2912 - val_out_counts_loss: 2.3398 - val_out_mean_covariance_loss: 63.2002 - val_out_fielding_position_loss: 2.3070
Epoch 61/1000

Epoch 00061: val_loss did not improve
 - 5s - loss: 11.3729 - out_stats_loss: 4.7713 - out_counts_loss: 1.7078 - out_mean_covariance_loss: 57.5011 - out_fielding_position_loss: 2.0188 - val_loss: 13.1433 - val_out_stats_loss: 5.3035 - val_out_counts_loss: 2.3620 - val_out_mean_covariance_loss: 63.2742 - val_out_fielding_position_loss: 2.3141
Epoch 62/1000

Epoch 00062: val_loss did not improve
 - 5s - loss: 11.3225 - out_stats_loss: 4.7581 - out_counts_loss: 1.6847 - out_mean_covariance_loss: 57.3116 - out_fielding_position_loss: 2.0141 - val_loss: 13.0976 - val_out_stats_loss: 5.2866 - val_out_counts_loss: 2.3461 - val_out_mean_covariance_loss: 63.1239 - val_out_fielding_position_loss: 2.3088
Epoch 63/1000

Epoch 00063: val_loss did not improve
 - 4s - loss: 11.2668 - out_stats_loss: 4.7508 - out_counts_loss: 1.6836 - out_mean_covariance_loss: 56.8898 - out_fielding_position_loss: 1.9880 - val_loss: 13.1610 - val_out_stats_loss: 5.3096 - val_out_counts_loss: 2.3764 - val_out_mean_covariance_loss: 63.4095 - val_out_fielding_position_loss: 2.3046
Epoch 64/1000

Epoch 00064: val_loss did not improve
 - 4s - loss: 11.2797 - out_stats_loss: 4.7658 - out_counts_loss: 1.6633 - out_mean_covariance_loss: 57.5656 - out_fielding_position_loss: 1.9723 - val_loss: 13.1327 - val_out_stats_loss: 5.2978 - val_out_counts_loss: 2.3735 - val_out_mean_covariance_loss: 63.2929 - val_out_fielding_position_loss: 2.2967
Epoch 65/1000

Epoch 00065: val_loss did not improve
 - 5s - loss: 11.2216 - out_stats_loss: 4.7447 - out_counts_loss: 1.6506 - out_mean_covariance_loss: 56.9849 - out_fielding_position_loss: 1.9771 - val_loss: 13.2028 - val_out_stats_loss: 5.3310 - val_out_counts_loss: 2.4014 - val_out_mean_covariance_loss: 63.3402 - val_out_fielding_position_loss: 2.3034
Epoch 66/1000

Epoch 00066: val_loss did not improve
 - 5s - loss: 11.2334 - out_stats_loss: 4.7514 - out_counts_loss: 1.6440 - out_mean_covariance_loss: 57.4854 - out_fielding_position_loss: 1.9638 - val_loss: 13.1325 - val_out_stats_loss: 5.2890 - val_out_counts_loss: 2.3828 - val_out_mean_covariance_loss: 63.2090 - val_out_fielding_position_loss: 2.3003
Epoch 67/1000

Epoch 00067: val_loss did not improve
 - 4s - loss: 11.1757 - out_stats_loss: 4.7295 - out_counts_loss: 1.6500 - out_mean_covariance_loss: 56.7030 - out_fielding_position_loss: 1.9611 - val_loss: 13.1450 - val_out_stats_loss: 5.3026 - val_out_counts_loss: 2.3854 - val_out_mean_covariance_loss: 63.2342 - val_out_fielding_position_loss: 2.2954
Epoch 68/1000

Epoch 00068: val_loss did not improve
 - 4s - loss: 11.1175 - out_stats_loss: 4.7056 - out_counts_loss: 1.6471 - out_mean_covariance_loss: 56.3762 - out_fielding_position_loss: 1.9460 - val_loss: 13.1526 - val_out_stats_loss: 5.3205 - val_out_counts_loss: 2.3786 - val_out_mean_covariance_loss: 63.2811 - val_out_fielding_position_loss: 2.2894
Epoch 69/1000

Epoch 00069: val_loss did not improve
 - 4s - loss: 11.1345 - out_stats_loss: 4.7262 - out_counts_loss: 1.6400 - out_mean_covariance_loss: 56.6183 - out_fielding_position_loss: 1.9374 - val_loss: 13.1169 - val_out_stats_loss: 5.3051 - val_out_counts_loss: 2.3713 - val_out_mean_covariance_loss: 63.1816 - val_out_fielding_position_loss: 2.2813
Epoch 70/1000

Epoch 00070: val_loss did not improve
 - 4s - loss: 11.1128 - out_stats_loss: 4.7267 - out_counts_loss: 1.6282 - out_mean_covariance_loss: 56.3515 - out_fielding_position_loss: 1.9404 - val_loss: 13.1665 - val_out_stats_loss: 5.3178 - val_out_counts_loss: 2.4003 - val_out_mean_covariance_loss: 63.2966 - val_out_fielding_position_loss: 2.2835
Epoch 71/1000

Epoch 00071: val_loss did not improve
 - 4s - loss: 11.1048 - out_stats_loss: 4.7223 - out_counts_loss: 1.6289 - out_mean_covariance_loss: 56.5607 - out_fielding_position_loss: 1.9255 - val_loss: 13.3508 - val_out_stats_loss: 5.3867 - val_out_counts_loss: 2.4830 - val_out_mean_covariance_loss: 63.5782 - val_out_fielding_position_loss: 2.3021
Epoch 72/1000

Epoch 00072: val_loss did not improve
 - 5s - loss: 11.0545 - out_stats_loss: 4.7088 - out_counts_loss: 1.6192 - out_mean_covariance_loss: 56.4468 - out_fielding_position_loss: 1.9041 - val_loss: 13.2281 - val_out_stats_loss: 5.3487 - val_out_counts_loss: 2.4300 - val_out_mean_covariance_loss: 63.5055 - val_out_fielding_position_loss: 2.2742
Epoch 73/1000

Epoch 00073: val_loss did not improve
 - 4s - loss: 11.0281 - out_stats_loss: 4.6919 - out_counts_loss: 1.6145 - out_mean_covariance_loss: 56.2405 - out_fielding_position_loss: 1.9097 - val_loss: 13.1289 - val_out_stats_loss: 5.2995 - val_out_counts_loss: 2.3938 - val_out_mean_covariance_loss: 63.1177 - val_out_fielding_position_loss: 2.2798
Epoch 74/1000

Epoch 00074: val_loss did not improve
 - 5s - loss: 11.0095 - out_stats_loss: 4.6848 - out_counts_loss: 1.6126 - out_mean_covariance_loss: 56.1222 - out_fielding_position_loss: 1.9059 - val_loss: 13.1445 - val_out_stats_loss: 5.3008 - val_out_counts_loss: 2.4105 - val_out_mean_covariance_loss: 63.1901 - val_out_fielding_position_loss: 2.2737
Epoch 75/1000

Epoch 00075: val_loss did not improve
 - 5s - loss: 11.0559 - out_stats_loss: 4.7276 - out_counts_loss: 1.6003 - out_mean_covariance_loss: 56.6353 - out_fielding_position_loss: 1.8962 - val_loss: 13.2813 - val_out_stats_loss: 5.3486 - val_out_counts_loss: 2.4690 - val_out_mean_covariance_loss: 63.6103 - val_out_fielding_position_loss: 2.2832
Epoch 76/1000

Epoch 00076: val_loss did not improve
 - 4s - loss: 10.9518 - out_stats_loss: 4.6826 - out_counts_loss: 1.5982 - out_mean_covariance_loss: 55.8382 - out_fielding_position_loss: 1.8791 - val_loss: 13.1919 - val_out_stats_loss: 5.3226 - val_out_counts_loss: 2.4385 - val_out_mean_covariance_loss: 63.2153 - val_out_fielding_position_loss: 2.2701
Epoch 77/1000

Epoch 00077: val_loss did not improve
 - 5s - loss: 10.9422 - out_stats_loss: 4.6676 - out_counts_loss: 1.6045 - out_mean_covariance_loss: 55.7266 - out_fielding_position_loss: 1.8838 - val_loss: 13.3434 - val_out_stats_loss: 5.3632 - val_out_counts_loss: 2.5090 - val_out_mean_covariance_loss: 63.6012 - val_out_fielding_position_loss: 2.2910
Epoch 78/1000

Epoch 00078: val_loss did not improve
 - 5s - loss: 10.9680 - out_stats_loss: 4.6956 - out_counts_loss: 1.5949 - out_mean_covariance_loss: 56.1464 - out_fielding_position_loss: 1.8702 - val_loss: 13.2340 - val_out_stats_loss: 5.3220 - val_out_counts_loss: 2.4657 - val_out_mean_covariance_loss: 63.6947 - val_out_fielding_position_loss: 2.2615
Epoch 79/1000

Epoch 00079: val_loss did not improve
 - 5s - loss: 10.9328 - out_stats_loss: 4.6796 - out_counts_loss: 1.5835 - out_mean_covariance_loss: 56.0178 - out_fielding_position_loss: 1.8689 - val_loss: 13.2294 - val_out_stats_loss: 5.3306 - val_out_counts_loss: 2.4620 - val_out_mean_covariance_loss: 63.3688 - val_out_fielding_position_loss: 2.2684
Epoch 80/1000

Epoch 00080: val_loss did not improve
 - 4s - loss: 10.8671 - out_stats_loss: 4.6562 - out_counts_loss: 1.5802 - out_mean_covariance_loss: 55.3932 - out_fielding_position_loss: 1.8610 - val_loss: 13.4930 - val_out_stats_loss: 5.4425 - val_out_counts_loss: 2.5469 - val_out_mean_covariance_loss: 64.0757 - val_out_fielding_position_loss: 2.2998
Epoch 81/1000

Epoch 00081: val_loss did not improve
 - 4s - loss: 10.8390 - out_stats_loss: 4.6353 - out_counts_loss: 1.5869 - out_mean_covariance_loss: 55.2760 - out_fielding_position_loss: 1.8531 - val_loss: 13.4326 - val_out_stats_loss: 5.3870 - val_out_counts_loss: 2.5606 - val_out_mean_covariance_loss: 63.8320 - val_out_fielding_position_loss: 2.2934
Epoch 82/1000

Epoch 00082: val_loss did not improve
 - 5s - loss: 10.8316 - out_stats_loss: 4.6496 - out_counts_loss: 1.5693 - out_mean_covariance_loss: 55.4228 - out_fielding_position_loss: 1.8416 - val_loss: 13.2201 - val_out_stats_loss: 5.3181 - val_out_counts_loss: 2.4603 - val_out_mean_covariance_loss: 63.5368 - val_out_fielding_position_loss: 2.2648
Epoch 83/1000

Epoch 00083: val_loss did not improve
 - 5s - loss: 10.8131 - out_stats_loss: 4.6439 - out_counts_loss: 1.5520 - out_mean_covariance_loss: 55.5193 - out_fielding_position_loss: 1.8413 - val_loss: 13.1860 - val_out_stats_loss: 5.3017 - val_out_counts_loss: 2.4509 - val_out_mean_covariance_loss: 63.3321 - val_out_fielding_position_loss: 2.2668
Epoch 84/1000

Epoch 00084: val_loss did not improve
 - 4s - loss: 10.7630 - out_stats_loss: 4.6219 - out_counts_loss: 1.5555 - out_mean_covariance_loss: 55.0543 - out_fielding_position_loss: 1.8329 - val_loss: 13.3205 - val_out_stats_loss: 5.3456 - val_out_counts_loss: 2.5029 - val_out_mean_covariance_loss: 63.5572 - val_out_fielding_position_loss: 2.2941
Epoch 85/1000

Epoch 00085: val_loss did not improve
 - 5s - loss: 10.8257 - out_stats_loss: 4.6604 - out_counts_loss: 1.5707 - out_mean_covariance_loss: 55.4728 - out_fielding_position_loss: 1.8210 - val_loss: 13.3242 - val_out_stats_loss: 5.3540 - val_out_counts_loss: 2.5102 - val_out_mean_covariance_loss: 63.5171 - val_out_fielding_position_loss: 2.2841
Epoch 86/1000

Epoch 00086: val_loss did not improve
 - 4s - loss: 10.7618 - out_stats_loss: 4.6311 - out_counts_loss: 1.5640 - out_mean_covariance_loss: 54.9276 - out_fielding_position_loss: 1.8204 - val_loss: 13.2036 - val_out_stats_loss: 5.3166 - val_out_counts_loss: 2.4577 - val_out_mean_covariance_loss: 63.4290 - val_out_fielding_position_loss: 2.2578
Epoch 87/1000

Epoch 00087: val_loss did not improve
 - 4s - loss: 10.7738 - out_stats_loss: 4.6456 - out_counts_loss: 1.5509 - out_mean_covariance_loss: 55.3623 - out_fielding_position_loss: 1.8092 - val_loss: 13.2899 - val_out_stats_loss: 5.3348 - val_out_counts_loss: 2.5153 - val_out_mean_covariance_loss: 63.4511 - val_out_fielding_position_loss: 2.2672
Epoch 88/1000

Epoch 00088: val_loss did not improve
 - 5s - loss: 10.7053 - out_stats_loss: 4.6102 - out_counts_loss: 1.5529 - out_mean_covariance_loss: 54.7710 - out_fielding_position_loss: 1.8036 - val_loss: 13.2747 - val_out_stats_loss: 5.3255 - val_out_counts_loss: 2.5083 - val_out_mean_covariance_loss: 63.5635 - val_out_fielding_position_loss: 2.2627
Epoch 89/1000

Epoch 00089: val_loss did not improve
 - 5s - loss: 10.6962 - out_stats_loss: 4.6144 - out_counts_loss: 1.5375 - out_mean_covariance_loss: 54.8651 - out_fielding_position_loss: 1.8011 - val_loss: 13.2629 - val_out_stats_loss: 5.3318 - val_out_counts_loss: 2.4962 - val_out_mean_covariance_loss: 63.4070 - val_out_fielding_position_loss: 2.2646
Epoch 90/1000

Epoch 00090: val_loss did not improve
 - 4s - loss: 10.7273 - out_stats_loss: 4.6382 - out_counts_loss: 1.5505 - out_mean_covariance_loss: 54.8873 - out_fielding_position_loss: 1.7942 - val_loss: 13.3582 - val_out_stats_loss: 5.3602 - val_out_counts_loss: 2.5403 - val_out_mean_covariance_loss: 63.6261 - val_out_fielding_position_loss: 2.2764
Epoch 91/1000

Epoch 00091: val_loss did not improve
 - 4s - loss: 10.6516 - out_stats_loss: 4.6187 - out_counts_loss: 1.5181 - out_mean_covariance_loss: 54.7704 - out_fielding_position_loss: 1.7763 - val_loss: 13.2586 - val_out_stats_loss: 5.3352 - val_out_counts_loss: 2.4963 - val_out_mean_covariance_loss: 63.5460 - val_out_fielding_position_loss: 2.2499
Epoch 92/1000

Epoch 00092: val_loss did not improve
 - 5s - loss: 10.6382 - out_stats_loss: 4.6056 - out_counts_loss: 1.5195 - out_mean_covariance_loss: 54.7386 - out_fielding_position_loss: 1.7763 - val_loss: 13.3704 - val_out_stats_loss: 5.3717 - val_out_counts_loss: 2.5334 - val_out_mean_covariance_loss: 63.8592 - val_out_fielding_position_loss: 2.2724
Epoch 93/1000

Epoch 00093: val_loss did not improve
 - 4s - loss: 10.6356 - out_stats_loss: 4.6141 - out_counts_loss: 1.5115 - out_mean_covariance_loss: 54.9178 - out_fielding_position_loss: 1.7641 - val_loss: 13.2620 - val_out_stats_loss: 5.3216 - val_out_counts_loss: 2.5126 - val_out_mean_covariance_loss: 63.5967 - val_out_fielding_position_loss: 2.2480
/usr/local/lib/python3.5/dist-packages/h5py/__init__.py:36: FutureWarning: Conversion of the second argument of issubdtype from `float` to `np.floating` is deprecated. In future, it will be treated as `np.float64 == np.dtype(float).type`.
  from ._conv import register_converters as _register_converters
Using TensorFlow backend.
Years: [1958,2014]
Shift: 2
Fold: 4
Training into models/bc/shift2/max2014/simple-rnn/6.h5
/usr/local/lib/python3.5/dist-packages/keras/legacy/layers.py:533: UserWarning: The `MaxoutDense` layer is deprecated and will be removed after 06/2017.
  warnings.warn('The `MaxoutDense` layer is deprecated '
