__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
in_out_stats_extended (InputLay (None, None, 36)     0                                            
__________________________________________________________________________________________________
masked_in_out_stats_extended (M (None, None, 36)     0           in_out_stats_extended[0][0]      
__________________________________________________________________________________________________
in_out_league_offense (InputLay (None, None, 9)      0                                            
__________________________________________________________________________________________________
time_distributed_3 (TimeDistrib (None, None, 35)     0           masked_in_out_stats_extended[0][0
__________________________________________________________________________________________________
masked_in_out_league_offense (M (None, None, 9)      0           in_out_league_offense[0][0]      
__________________________________________________________________________________________________
in_out_park_factors (InputLayer (None, None, 8)      0                                            
__________________________________________________________________________________________________
in_out_saber (InputLayer)       (None, None, 14)     0                                            
__________________________________________________________________________________________________
norm_in_out_stats_extended (New (None, None, 35)     140         time_distributed_3[0][0]         
__________________________________________________________________________________________________
time_distributed_5 (TimeDistrib (None, None, 8)      0           masked_in_out_league_offense[0][0
__________________________________________________________________________________________________
masked_in_out_park_factors (Mas (None, None, 8)      0           in_out_park_factors[0][0]        
__________________________________________________________________________________________________
masked_in_out_saber (Masking)   (None, None, 14)     0           in_out_saber[0][0]               
__________________________________________________________________________________________________
in_out_plate_discipline (InputL (None, None, 8)      0                                            
__________________________________________________________________________________________________
in_out_running (InputLayer)     (None, None, 18)     0                                            
__________________________________________________________________________________________________
div_in_out_stats_extended (Time (None, None, 105)    3780        norm_in_out_stats_extended[0][0] 
__________________________________________________________________________________________________
norm_in_out_league_offense (New (None, None, 8)      32          time_distributed_5[0][0]         
__________________________________________________________________________________________________
time_distributed_8 (TimeDistrib (None, None, 7)      0           masked_in_out_park_factors[0][0] 
__________________________________________________________________________________________________
time_distributed_6 (TimeDistrib (None, None, 13)     0           masked_in_out_saber[0][0]        
__________________________________________________________________________________________________
masked_in_out_plate_discipline  (None, None, 8)      0           in_out_plate_discipline[0][0]    
__________________________________________________________________________________________________
masked_in_out_running (Masking) (None, None, 18)     0           in_out_running[0][0]             
__________________________________________________________________________________________________
activation_13 (Activation)      (None, None, 105)    0           div_in_out_stats_extended[0][0]  
__________________________________________________________________________________________________
rand_in_out_league_offense (Gau (None, None, 8)      0           norm_in_out_league_offense[0][0] 
__________________________________________________________________________________________________
norm_in_out_park_factors (Batch (None, None, 7)      28          time_distributed_8[0][0]         
__________________________________________________________________________________________________
norm_in_out_saber (BatchNormali (None, None, 13)     52          time_distributed_6[0][0]         
__________________________________________________________________________________________________
time_distributed_7 (TimeDistrib (None, None, 7)      0           masked_in_out_plate_discipline[0]
__________________________________________________________________________________________________
time_distributed_4 (TimeDistrib (None, None, 17)     0           masked_in_out_running[0][0]      
__________________________________________________________________________________________________
in_out_fielding_position (Input (None, None, 12)     0                                            
__________________________________________________________________________________________________
in_bio (InputLayer)             (None, None, 7)      0                                            
__________________________________________________________________________________________________
in_park_factors (InputLayer)    (None, None, 8)      0                                            
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, None, 105)    0           activation_13[0][0]              
__________________________________________________________________________________________________
dense_in_out_league_offense (Ti (None, None, 8)      72          rand_in_out_league_offense[0][0] 
__________________________________________________________________________________________________
dense_in_out_park_factors (Time (None, None, 14)     112         norm_in_out_park_factors[0][0]   
__________________________________________________________________________________________________
dense_in_out_saber (TimeDistrib (None, None, 26)     364         norm_in_out_saber[0][0]          
__________________________________________________________________________________________________
norm_in_out_plate_discipline (B (None, None, 7)      28          time_distributed_7[0][0]         
__________________________________________________________________________________________________
norm_in_out_running (BatchNorma (None, None, 17)     68          time_distributed_4[0][0]         
__________________________________________________________________________________________________
masked_in_out_fielding_position (None, None, 12)     0           in_out_fielding_position[0][0]   
__________________________________________________________________________________________________
masked_in_bio (Masking)         (None, None, 7)      0           in_bio[0][0]                     
__________________________________________________________________________________________________
masked_in_park_factors (Masking (None, None, 8)      0           in_park_factors[0][0]            
__________________________________________________________________________________________________
time_distributed_14 (TimeDistri (None, None, 35)     3710        dropout_2[0][0]                  
__________________________________________________________________________________________________
activation_12 (Activation)      (None, None, 8)      0           dense_in_out_league_offense[0][0]
__________________________________________________________________________________________________
activation_2 (Activation)       (None, None, 14)     0           dense_in_out_park_factors[0][0]  
__________________________________________________________________________________________________
activation_8 (Activation)       (None, None, 26)     0           dense_in_out_saber[0][0]         
__________________________________________________________________________________________________
div_in_out_plate_discipline (Ti (None, None, 21)     168         norm_in_out_plate_discipline[0][0
__________________________________________________________________________________________________
div_in_out_running (TimeDistrib (None, None, 51)     918         norm_in_out_running[0][0]        
__________________________________________________________________________________________________
time_distributed_1 (TimeDistrib (None, None, 11)     0           masked_in_out_fielding_position[0
__________________________________________________________________________________________________
time_distributed_11 (TimeDistri (None, None, 6)      0           masked_in_bio[0][0]              
__________________________________________________________________________________________________
time_distributed_9 (TimeDistrib (None, None, 7)      0           masked_in_park_factors[0][0]     
__________________________________________________________________________________________________
activation_18 (Activation)      (None, None, 35)     0           time_distributed_14[0][0]        
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, None, 8)      0           activation_12[0][0]              
__________________________________________________________________________________________________
dropout_10 (Dropout)            (None, None, 14)     0           activation_2[0][0]               
__________________________________________________________________________________________________
dropout_11 (Dropout)            (None, None, 26)     0           activation_8[0][0]               
__________________________________________________________________________________________________
activation_14 (Activation)      (None, None, 21)     0           div_in_out_plate_discipline[0][0]
__________________________________________________________________________________________________
activation_15 (Activation)      (None, None, 51)     0           div_in_out_running[0][0]         
__________________________________________________________________________________________________
norm_in_out_fielding_position ( (None, None, 11)     44          time_distributed_1[0][0]         
__________________________________________________________________________________________________
in_fielding_position (InputLaye (None, None, 2)      0                                            
__________________________________________________________________________________________________
in_age (InputLayer)             (None, None, 2)      0                                            
__________________________________________________________________________________________________
norm_in_bio (BatchNormalization (None, None, 6)      24          time_distributed_11[0][0]        
__________________________________________________________________________________________________
norm_in_park_factors (BatchNorm (None, None, 7)      28          time_distributed_9[0][0]         
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, None, 83)     0           activation_18[0][0]              
                                                                 dropout_4[0][0]                  
                                                                 dropout_10[0][0]                 
                                                                 dropout_11[0][0]                 
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, None, 21)     0           activation_14[0][0]              
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, None, 51)     0           activation_15[0][0]              
__________________________________________________________________________________________________
dense_in_out_fielding_position  (None, None, 22)     264         norm_in_out_fielding_position[0][
__________________________________________________________________________________________________
masked_in_fielding_position (Ma (None, None, 2)      0           in_fielding_position[0][0]       
__________________________________________________________________________________________________
masked_in_age (Masking)         (None, None, 2)      0           in_age[0][0]                     
__________________________________________________________________________________________________
dense_in_bio (TimeDistributed)  (None, None, 12)     84          norm_in_bio[0][0]                
__________________________________________________________________________________________________
dense_in_park_factors (TimeDist (None, None, 14)     112         norm_in_park_factors[0][0]       
__________________________________________________________________________________________________
time_distributed_15 (TimeDistri (None, None, 48)     4032        concatenate_1[0][0]              
__________________________________________________________________________________________________
time_distributed_12 (TimeDistri (None, None, 7)      154         dropout_3[0][0]                  
__________________________________________________________________________________________________
time_distributed_13 (TimeDistri (None, None, 17)     884         dropout_1[0][0]                  
__________________________________________________________________________________________________
activation_3 (Activation)       (None, None, 22)     0           dense_in_out_fielding_position[0]
__________________________________________________________________________________________________
time_distributed_2 (TimeDistrib (None, None, 1)      0           masked_in_fielding_position[0][0]
__________________________________________________________________________________________________
time_distributed_10 (TimeDistri (None, None, 1)      0           masked_in_age[0][0]              
__________________________________________________________________________________________________
activation_11 (Activation)      (None, None, 12)     0           dense_in_bio[0][0]               
__________________________________________________________________________________________________
activation_9 (Activation)       (None, None, 14)     0           dense_in_park_factors[0][0]      
__________________________________________________________________________________________________
activation_19 (Activation)      (None, None, 48)     0           time_distributed_15[0][0]        
__________________________________________________________________________________________________
activation_16 (Activation)      (None, None, 7)      0           time_distributed_12[0][0]        
__________________________________________________________________________________________________
activation_17 (Activation)      (None, None, 17)     0           time_distributed_13[0][0]        
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, None, 22)     0           activation_3[0][0]               
__________________________________________________________________________________________________
embed_in_fielding_position (Tim (None, None, 1, 8)   88          time_distributed_2[0][0]         
__________________________________________________________________________________________________
embed_in_age (TimeDistributed)  (None, None, 1, 8)   520         time_distributed_10[0][0]        
__________________________________________________________________________________________________
dropout_14 (Dropout)            (None, None, 12)     0           activation_11[0][0]              
__________________________________________________________________________________________________2018-02-08 17:23:27.275880: I tensorflow/core/platform/cpu_feature_guard.cc:137] Your CPU supports instructions that this TensorFlow binary was not compiled to use: SSE4.1 SSE4.2 AVX AVX2 FMA
2018-02-08 17:23:34.389160: I tensorflow/core/common_runtime/gpu/gpu_device.cc:1105] Found device 0 with properties: 
name: Tesla K80 major: 3 minor: 7 memoryClockRate(GHz): 0.8235
pciBusID: 5823:00:00.0
totalMemory: 11.17GiB freeMemory: 11.10GiB
2018-02-08 17:23:34.389205: I tensorflow/core/common_runtime/gpu/gpu_device.cc:1195] Creating TensorFlow device (/device:GPU:0) -> (device: 0, name: Tesla K80, pci bus id: 5823:00:00.0, compute capability: 3.7)
2018-02-08 17:24:17.227393: I tensorflow/core/common_runtime/gpu/gpu_device.cc:1195] Creating TensorFlow device (/device:GPU:0) -> (device: 0, name: Tesla K80, pci bus id: 5823:00:00.0, compute capability: 3.7)
2018-02-08 17:24:18.350570: I tensorflow/core/kernels/cuda_solvers.cc:159] Creating CudaSolver handles for stream 0x1ce1e430
/usr/local/lib/python3.5/dist-packages/h5py/__init__.py:36: FutureWarning: Conversion of the second argument of issubdtype from `float` to `np.floating` is deprecated. In future, it will be treated as `np.float64 == np.dtype(float).type`.
  from ._conv import register_converters as _register_converters
Using TensorFlow backend.
Years: [1958,2016]
Shift: 2
Fold: 4
Training into models/bc/shift2/max2016/deep-dense/aggregate.pkl
/usr/local/lib/python3.5/dist-packages/keras/legacy/layers.py:533: UserWarning: The `MaxoutDense` layer is deprecated and will be removed after 06/2017.
  warnings.warn('The `MaxoutDense` layer is deprecated '
Aggregating from models/bc/shift2/max2016/deep-dense/5.h5
Aggregating from models/bc/shift2/max2016/deep-dense/4.h5
Aggregating from models/bc/shift2/max2016/deep-dense/7.h5
Aggregating from models/bc/shift2/max2016/deep-dense/2.h5
Aggregating from models/bc/shift2/max2016/deep-dense/6.h5
Aggregating from models/bc/shift2/max2016/deep-dense/0.h5
Aggregating from models/bc/shift2/max2016/deep-dense/1.h5
Aggregating from models/bc/shift2/max2016/deep-dense/3.h5
/home/dcalzad2/pymlb/pymlb/learning/aggregators/MSEPredictionAggregator.py:34: FutureWarning: `rcond` parameter will change to the default of machine precision times ``max(M, N)`` where M and N are the input matrix dimensions.
To use the future default and silence this warning we advise to pass `rcond=None`, to keep using the old, explicitly pass `rcond=-1`.
  weight_vector = la.lstsq(x, y)[0]

dropout_12 (Dropout)            (None, None, 14)     0           activation_9[0][0]               
__________________________________________________________________________________________________
gru_1 (GRU)                     (None, None, 48)     13968       activation_19[0][0]              
__________________________________________________________________________________________________
gru_2 (GRU)                     (None, None, 7)      315         activation_16[0][0]              
__________________________________________________________________________________________________
gru_3 (GRU)                     (None, None, 17)     1785        activation_17[0][0]              
__________________________________________________________________________________________________
gru_4 (GRU)                     (None, None, 22)     2970        dropout_6[0][0]                  
__________________________________________________________________________________________________
norm_in_fielding_position (Time (None, None, 8)      0           embed_in_fielding_position[0][0] 
__________________________________________________________________________________________________
norm_in_age (TimeDistributed)   (None, None, 8)      0           embed_in_age[0][0]               
__________________________________________________________________________________________________
time_distributed_16 (TimeDistri (None, None, 85)     1105        dropout_14[0][0]                 
__________________________________________________________________________________________________
time_distributed_17 (TimeDistri (None, None, 85)     1275        dropout_12[0][0]                 
__________________________________________________________________________________________________
time_distributed_18 (TimeDistri (None, None, 85)     4165        gru_1[0][0]                      
__________________________________________________________________________________________________
time_distributed_19 (TimeDistri (None, None, 85)     680         gru_2[0][0]                      
__________________________________________________________________________________________________
time_distributed_20 (TimeDistri (None, None, 85)     1530        gru_3[0][0]                      
__________________________________________________________________________________________________
time_distributed_21 (TimeDistri (None, None, 85)     1955        gru_4[0][0]                      
__________________________________________________________________________________________________
time_distributed_22 (TimeDistri (None, None, 85)     765         norm_in_fielding_position[0][0]  
__________________________________________________________________________________________________
time_distributed_23 (TimeDistri (None, None, 85)     765         norm_in_age[0][0]                
__________________________________________________________________________________________________
activation_20 (Activation)      (None, None, 85)     0           time_distributed_16[0][0]        
__________________________________________________________________________________________________
activation_21 (Activation)      (None, None, 85)     0           time_distributed_17[0][0]        
__________________________________________________________________________________________________
activation_22 (Activation)      (None, None, 85)     0           time_distributed_18[0][0]        
__________________________________________________________________________________________________
activation_23 (Activation)      (None, None, 85)     0           time_distributed_19[0][0]        
__________________________________________________________________________________________________
activation_24 (Activation)      (None, None, 85)     0           time_distributed_20[0][0]        
__________________________________________________________________________________________________
activation_25 (Activation)      (None, None, 85)     0           time_distributed_21[0][0]        
__________________________________________________________________________________________________
activation_26 (Activation)      (None, None, 85)     0           time_distributed_22[0][0]        
__________________________________________________________________________________________________
activation_27 (Activation)      (None, None, 85)     0           time_distributed_23[0][0]        
__________________________________________________________________________________________________
add_1 (Add)                     (None, None, 85)     0           activation_20[0][0]              
                                                                 activation_21[0][0]              
                                                                 activation_22[0][0]              
                                                                 activation_23[0][0]              
                                                                 activation_24[0][0]              
                                                                 activation_25[0][0]              
                                                                 activation_26[0][0]              
                                                                 activation_27[0][0]              
__________________________________________________________________________________________________
dropout_15 (Dropout)            (None, None, 85)     0           add_1[0][0]                      
__________________________________________________________________________________________________
time_distributed_24 (TimeDistri (None, None, 85)     7310        dropout_15[0][0]                 
__________________________________________________________________________________________________
activation_28 (Activation)      (None, None, 85)     0           time_distributed_24[0][0]        
__________________________________________________________________________________________________
magic_vector (Activation)       (None, None, 85)     0           activation_28[0][0]              
__________________________________________________________________________________________________
mv_out_stats (TimeDistributed)  (None, None, 5)      3440        magic_vector[0][0]               
__________________________________________________________________________________________________
mv_out_counts (TimeDistributed) (None, None, 3)      2064        magic_vector[0][0]               
__________________________________________________________________________________________________
mv_out_mean_covariance (TimeDis (None, None, 72)     49536       magic_vector[0][0]               
__________________________________________________________________________________________________
mv_out_fielding_position (TimeD (None, None, 11)     7568        magic_vector[0][0]               
__________________________________________________________________________________________________
out_stats (Activation)          (None, None, 5)      0           mv_out_stats[0][0]               
__________________________________________________________________________________________________
out_counts (Activation)         (None, None, 3)      0           mv_out_counts[0][0]              
__________________________________________________________________________________________________
out_mean_covariance (Activation (None, None, 72)     0           mv_out_mean_covariance[0][0]     
__________________________________________________________________________________________________
out_fielding_position (Activati (None, None, 11)     0           mv_out_fielding_position[0][0]   
==================================================================================================
Total params: 116,902
Trainable params: 116,594
Non-trainable params: 308
__________________________________________________________________________________________________
