__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
in_age (InputLayer)             (None, None, 2)      0                                            
__________________________________________________________________________________________________
in_bio (InputLayer)             (None, None, 7)      0                                            
__________________________________________________________________________________________________
in_fielding_position (InputLaye (None, None, 2)      0                                            
__________________________________________________________________________________________________
in_out_fielding_position (Input (None, None, 12)     0                                            
__________________________________________________________________________________________________
in_out_league_offense (InputLay (None, None, 9)      0                                            
__________________________________________________________________________________________________
in_out_park_factors (InputLayer (None, None, 8)      0                                            
__________________________________________________________________________________________________
in_out_plate_discipline (InputL (None, None, 8)      0                                            
__________________________________________________________________________________________________
in_out_running (InputLayer)     (None, None, 18)     0                                            
__________________________________________________________________________________________________
in_out_saber (InputLayer)       (None, None, 14)     0                                            
__________________________________________________________________________________________________
in_out_stats_extended (InputLay (None, None, 36)     0                                            
__________________________________________________________________________________________________
in_park_factors (InputLayer)    (None, None, 8)      0                                            
__________________________________________________________________________________________________
masked_in_age (Masking)         (None, None, 2)      0           in_age[0][0]                     
__________________________________________________________________________________________________
masked_in_bio (Masking)         (None, None, 7)      0           in_bio[0][0]                     
__________________________________________________________________________________________________
masked_in_fielding_position (Ma (None, None, 2)      0           in_fielding_position[0][0]       
__________________________________________________________________________________________________
masked_in_out_fielding_position (None, None, 12)     0           in_out_fielding_position[0][0]   
__________________________________________________________________________________________________
masked_in_out_league_offense (M (None, None, 9)      0           in_out_league_offense[0][0]      
__________________________________________________________________________________________________
masked_in_out_park_factors (Mas (None, None, 8)      0           in_out_park_factors[0][0]        
__________________________________________________________________________________________________
masked_in_out_plate_discipline  (None, None, 8)      0           in_out_plate_discipline[0][0]    
__________________________________________________________________________________________________
masked_in_out_running (Masking) (None, None, 18)     0           in_out_running[0][0]             
__________________________________________________________________________________________________
masked_in_out_saber (Masking)   (None, None, 14)     0           in_out_saber[0][0]               
__________________________________________________________________________________________________
masked_in_out_stats_extended (M (None, None, 36)     0           in_out_stats_extended[0][0]      
__________________________________________________________________________________________________
masked_in_park_factors (Masking (None, None, 8)      0           in_park_factors[0][0]            
__________________________________________________________________________________________________
time_distributed_2 (TimeDistrib (None, None, 1)      0           masked_in_age[0][0]              
__________________________________________________________________________________________________
time_distributed_1 (TimeDistrib (None, None, 6)      0           masked_in_bio[0][0]              
__________________________________________________________________________________________________
time_distributed_3 (TimeDistrib (None, None, 1)      0           masked_in_fielding_position[0][0]
__________________________________________________________________________________________________
time_distributed_10 (TimeDistri (None, None, 11)     0           masked_in_out_fielding_position[0
__________________________________________________________________________________________________
time_distributed_7 (TimeDistrib (None, None, 8)      0           masked_in_out_league_offense[0][0
__________________________________________________________________________________________________
time_distributed_5 (TimeDistrib (None, None, 7)      0           masked_in_out_park_factors[0][0] 
__________________________________________________________________________________________________
time_distributed_4 (TimeDistrib (None, None, 7)      0           masked_in_out_plate_discipline[0]
__________________________________________________________________________________________________
time_distributed_11 (TimeDistri (None, None, 17)     0           masked_in_out_running[0][0]      
__________________________________________________________________________________________________
time_distributed_8 (TimeDistrib (None, None, 13)     0           masked_in_out_saber[0][0]        
__________________________________________________________________________________________________
time_distributed_9 (TimeDistrib (None, None, 35)     0           masked_in_out_stats_extended[0][0
__________________________________________________________________________________________________
time_distributed_6 (TimeDistrib (None, None, 7)      0           masked_in_park_factors[0][0]     
__________________________________________________________________________________________________
norm_in_age (BatchNormalization (None, None, 1)      4           time_distributed_2[0][0]         
__________________________________________________________________________________________________
norm_in_bio (BatchNormalization (None, None, 6)      24          time_distributed_1[0][0]         
__________________________________________________________________________________________________
norm_in_fielding_position (Batc (None, None, 1)      4           time_distributed_3[0][0]         
__________________________________________________________________________________________________
norm_in_out_fielding_position ( (None, None, 11)     44          time_distributed_10[0][0]        
__________________________________________________________________________________________________
norm_in_out_league_offense (Bat (None, None, 8)      32          time_distributed_7[0][0]         
__________________________________________________________________________________________________
norm_in_out_park_factors (Batch (None, None, 7)      28          time_distributed_5[0][0]         
__________________________________________________________________________________________________
norm_in_out_plate_discipline (B (None, None, 7)      28          time_distributed_4[0][0]         
__________________________________________________________________________________________________2018-02-08 09:22:15.573760: I tensorflow/core/platform/cpu_feature_guard.cc:137] Your CPU supports instructions that this TensorFlow binary was not compiled to use: SSE4.1 SSE4.2 AVX AVX2 FMA
2018-02-08 09:22:22.750518: I tensorflow/core/common_runtime/gpu/gpu_device.cc:1105] Found device 0 with properties: 
name: Tesla K80 major: 3 minor: 7 memoryClockRate(GHz): 0.8235
pciBusID: eca0:00:00.0
totalMemory: 11.17GiB freeMemory: 11.10GiB
2018-02-08 09:22:22.750562: I tensorflow/core/common_runtime/gpu/gpu_device.cc:1195] Creating TensorFlow device (/device:GPU:0) -> (device: 0, name: Tesla K80, pci bus id: eca0:00:00.0, compute capability: 3.7)

norm_in_out_running (BatchNorma (None, None, 17)     68          time_distributed_11[0][0]        
__________________________________________________________________________________________________
norm_in_out_saber (BatchNormali (None, None, 13)     52          time_distributed_8[0][0]         
__________________________________________________________________________________________________
norm_in_out_stats_extended (Bat (None, None, 35)     140         time_distributed_9[0][0]         
__________________________________________________________________________________________________
norm_in_park_factors (BatchNorm (None, None, 7)      28          time_distributed_6[0][0]         
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, None, 113)    0           norm_in_age[0][0]                
                                                                 norm_in_bio[0][0]                
                                                                 norm_in_fielding_position[0][0]  
                                                                 norm_in_out_fielding_position[0][
                                                                 norm_in_out_league_offense[0][0] 
                                                                 norm_in_out_park_factors[0][0]   
                                                                 norm_in_out_plate_discipline[0][0
                                                                 norm_in_out_running[0][0]        
                                                                 norm_in_out_saber[0][0]          
                                                                 norm_in_out_stats_extended[0][0] 
                                                                 norm_in_park_factors[0][0]       
__________________________________________________________________________________________________
gru_1 (GRU)                     (None, None, 113)    76953       concatenate_1[0][0]              
__________________________________________________________________________________________________
gru_2 (GRU)                     (None, None, 113)    76953       gru_1[0][0]                      
__________________________________________________________________________________________________
mv_out_stats (TimeDistributed)  (None, None, 5)      4560        gru_2[0][0]                      
__________________________________________________________________________________________________
mv_out_counts (TimeDistributed) (None, None, 3)      2736        gru_2[0][0]                      
__________________________________________________________________________________________________
mv_out_mean_covariance (TimeDis (None, None, 72)     65664       gru_2[0][0]                      
__________________________________________________________________________________________________
mv_out_fielding_position (TimeD (None, None, 11)     10032       gru_2[0][0]                      
__________________________________________________________________________________________________
out_stats (Activation)          (None, None, 5)      0           mv_out_stats[0][0]               
__________________________________________________________________________________________________
out_counts (Activation)         (None, None, 3)      0           mv_out_counts[0][0]              
__________________________________________________________________________________________________
out_mean_covariance (Activation (None, None, 72)     0           mv_out_mean_covariance[0][0]     
__________________________________________________________________________________________________
out_fielding_position (Activati (None, None, 11)     0           mv_out_fielding_position[0][0]   
==================================================================================================
Total params: 237,350
Trainable params: 237,124
Non-trainable params: 226
__________________________________________________________________________________________________
Train on 5879 samples, validate on 1409 samples
Epoch 1/1000

Epoch 00001: val_loss improved from inf to 20.15857, saving model to models/bc/shift2/max2016/simple-rnn/7.h5
 - 16s - loss: 21.8629 - out_stats_loss: 8.3213 - out_counts_loss: 3.7515 - out_mean_covariance_loss: 105.2431 - out_fielding_position_loss: 4.5279 - val_loss: 20.1586 - val_out_stats_loss: 7.7813 - val_out_counts_loss: 3.1144 - val_out_mean_covariance_loss: 99.3710 - val_out_fielding_position_loss: 4.2943
Epoch 2/1000

Epoch 00002: val_loss improved from 20.15857 to 17.50529, saving model to models/bc/shift2/max2016/simple-rnn/7.h5
 - 5s - loss: 18.6509 - out_stats_loss: 7.0212 - out_counts_loss: 2.8633 - out_mean_covariance_loss: 92.6240 - out_fielding_position_loss: 4.1352 - val_loss: 17.5053 - val_out_stats_loss: 6.5681 - val_out_counts_loss: 2.6012 - val_out_mean_covariance_loss: 87.9329 - val_out_fielding_position_loss: 3.9394
Epoch 3/1000

Epoch 00003: val_loss improved from 17.50529 to 16.02488, saving model to models/bc/shift2/max2016/simple-rnn/7.h5
 - 5s - loss: 16.6327 - out_stats_loss: 6.1173 - out_counts_loss: 2.5820 - out_mean_covariance_loss: 82.2032 - out_fielding_position_loss: 3.8233 - val_loss: 16.0249 - val_out_stats_loss: 5.9960 - val_out_counts_loss: 2.4041 - val_out_mean_covariance_loss: 79.6030 - val_out_fielding_position_loss: 3.6446
Epoch 4/1000

Epoch 00004: val_loss improved from 16.02488 to 15.28557, saving model to models/bc/shift2/max2016/simple-rnn/7.h5
 - 5s - loss: 15.6342 - out_stats_loss: 5.7895 - out_counts_loss: 2.4635 - out_mean_covariance_loss: 76.6424 - out_fielding_position_loss: 3.5491 - val_loss: 15.2856 - val_out_stats_loss: 5.8107 - val_out_counts_loss: 2.3456 - val_out_mean_covariance_loss: 75.1756 - val_out_fielding_position_loss: 3.3705
Epoch 5/1000

Epoch 00005: val_loss improved from 15.28557 to 14.76271, saving model to models/bc/shift2/max2016/simple-rnn/7.h5
 - 5s - loss: 14.9799 - out_stats_loss: 5.6479 - out_counts_loss: 2.3973 - out_mean_covariance_loss: 72.9026 - out_fielding_position_loss: 3.2895 - val_loss: 14.7627 - val_out_stats_loss: 5.6993 - val_out_counts_loss: 2.2804 - val_out_mean_covariance_loss: 72.2778 - val_out_fielding_position_loss: 3.1692
Epoch 6/1000

Epoch 00006: val_loss improved from 14.76271 to 14.40959, saving model to models/bc/shift2/max2016/simple-rnn/7.h5
 - 5s - loss: 14.5416 - out_stats_loss: 5.5401 - out_counts_loss: 2.3617 - out_mean_covariance_loss: 70.2389 - out_fielding_position_loss: 3.1279 - val_loss: 14.4096 - val_out_stats_loss: 5.6175 - val_out_counts_loss: 2.2601 - val_out_mean_covariance_loss: 70.4300 - val_out_fielding_position_loss: 3.0105
Epoch 7/1000

Epoch 00007: val_loss improved from 14.40959 to 14.29542, saving model to models/bc/shift2/max2016/simple-rnn/7.h5
 - 5s - loss: 14.2735 - out_stats_loss: 5.4961 - out_counts_loss: 2.3419 - out_mean_covariance_loss: 69.1057 - out_fielding_position_loss: 2.9802 - val_loss: 14.2954 - val_out_stats_loss: 5.5958 - val_out_counts_loss: 2.3229 - val_out_mean_covariance_loss: 69.6541 - val_out_fielding_position_loss: 2.8940
Epoch 8/1000

Epoch 00008: val_loss improved from 14.29542 to 13.98483, saving model to models/bc/shift2/max2016/simple-rnn/7.h5
 - 5s - loss: 14.0232 - out_stats_loss: 5.4441 - out_counts_loss: 2.3094 - out_mean_covariance_loss: 67.9814 - out_fielding_position_loss: 2.8706 - val_loss: 13.9848 - val_out_stats_loss: 5.5223 - val_out_counts_loss: 2.2325 - val_out_mean_covariance_loss: 68.6445 - val_out_fielding_position_loss: 2.7978
Epoch 9/1000

Epoch 00009: val_loss improved from 13.98483 to 13.84307, saving model to models/bc/shift2/max2016/simple-rnn/7.h5
 - 5s - loss: 13.8624 - out_stats_loss: 5.3990 - out_counts_loss: 2.2942 - out_mean_covariance_loss: 67.4730 - out_fielding_position_loss: 2.7956 - val_loss: 13.8431 - val_out_stats_loss: 5.4866 - val_out_counts_loss: 2.2216 - val_out_mean_covariance_loss: 68.1007 - val_out_fielding_position_loss: 2.7298
Epoch 10/1000

Epoch 00010: val_loss improved from 13.84307 to 13.74244, saving model to models/bc/shift2/max2016/simple-rnn/7.h5
 - 5s - loss: 13.7473 - out_stats_loss: 5.3882 - out_counts_loss: 2.2783 - out_mean_covariance_loss: 67.0455 - out_fielding_position_loss: 2.7285 - val_loss: 13.7424 - val_out_stats_loss: 5.4529 - val_out_counts_loss: 2.2279 - val_out_mean_covariance_loss: 67.6503 - val_out_fielding_position_loss: 2.6791
Epoch 11/1000

Epoch 00011: val_loss improved from 13.74244 to 13.62672, saving model to models/bc/shift2/max2016/simple-rnn/7.h5
 - 5s - loss: 13.6272 - out_stats_loss: 5.3401 - out_counts_loss: 2.2738 - out_mean_covariance_loss: 66.4583 - out_fielding_position_loss: 2.6905 - val_loss: 13.6267 - val_out_stats_loss: 5.4170 - val_out_counts_loss: 2.2114 - val_out_mean_covariance_loss: 67.3179 - val_out_fielding_position_loss: 2.6324
Epoch 12/1000

Epoch 00012: val_loss did not improve
 - 5s - loss: 13.4438 - out_stats_loss: 5.2779 - out_counts_loss: 2.2562 - out_mean_covariance_loss: 65.5737 - out_fielding_position_loss: 2.6310 - val_loss: 13.6312 - val_out_stats_loss: 5.4269 - val_out_counts_loss: 2.2407 - val_out_mean_covariance_loss: 67.2128 - val_out_fielding_position_loss: 2.6029
Epoch 13/1000

Epoch 00013: val_loss improved from 13.62672 to 13.48561, saving model to models/bc/shift2/max2016/simple-rnn/7.h5
 - 5s - loss: 13.3262 - out_stats_loss: 5.2358 - out_counts_loss: 2.2292 - out_mean_covariance_loss: 65.2510 - out_fielding_position_loss: 2.5986 - val_loss: 13.4856 - val_out_stats_loss: 5.3788 - val_out_counts_loss: 2.1948 - val_out_mean_covariance_loss: 66.6703 - val_out_fielding_position_loss: 2.5784
Epoch 14/1000

Epoch 00014: val_loss improved from 13.48561 to 13.46485, saving model to models/bc/shift2/max2016/simple-rnn/7.h5
 - 5s - loss: 13.2450 - out_stats_loss: 5.2184 - out_counts_loss: 2.2150 - out_mean_covariance_loss: 64.7611 - out_fielding_position_loss: 2.5736 - val_loss: 13.4649 - val_out_stats_loss: 5.3728 - val_out_counts_loss: 2.2123 - val_out_mean_covariance_loss: 66.5006 - val_out_fielding_position_loss: 2.5547
Epoch 15/1000

Epoch 00015: val_loss improved from 13.46485 to 13.37887, saving model to models/bc/shift2/max2016/simple-rnn/7.h5
 - 5s - loss: 13.2258 - out_stats_loss: 5.2254 - out_counts_loss: 2.2152 - out_mean_covariance_loss: 64.7187 - out_fielding_position_loss: 2.5492 - val_loss: 13.3789 - val_out_stats_loss: 5.3425 - val_out_counts_loss: 2.1846 - val_out_mean_covariance_loss: 66.2019 - val_out_fielding_position_loss: 2.5417
Epoch 16/1000

Epoch 00016: val_loss improved from 13.37887 to 13.37043, saving model to models/bc/shift2/max2016/simple-rnn/7.h5
 - 5s - loss: 13.2364 - out_stats_loss: 5.2376 - out_counts_loss: 2.2124 - out_mean_covariance_loss: 64.8717 - out_fielding_position_loss: 2.5429 - val_loss: 13.3704 - val_out_stats_loss: 5.3485 - val_out_counts_loss: 2.1891 - val_out_mean_covariance_loss: 66.0771 - val_out_fielding_position_loss: 2.5290
Epoch 17/1000

Epoch 00017: val_loss improved from 13.37043 to 13.32186, saving model to models/bc/shift2/max2016/simple-rnn/7.h5
 - 5s - loss: 13.1427 - out_stats_loss: 5.2124 - out_counts_loss: 2.1852 - out_mean_covariance_loss: 64.4536 - out_fielding_position_loss: 2.5225 - val_loss: 13.3219 - val_out_stats_loss: 5.3331 - val_out_counts_loss: 2.1797 - val_out_mean_covariance_loss: 65.8625 - val_out_fielding_position_loss: 2.5160
Epoch 18/1000

Epoch 00018: val_loss improved from 13.32186 to 13.30643, saving model to models/bc/shift2/max2016/simple-rnn/7.h5
 - 5s - loss: 12.9434 - out_stats_loss: 5.1453 - out_counts_loss: 2.1435 - out_mean_covariance_loss: 63.3102 - out_fielding_position_loss: 2.4891 - val_loss: 13.3064 - val_out_stats_loss: 5.3331 - val_out_counts_loss: 2.1896 - val_out_mean_covariance_loss: 65.6713 - val_out_fielding_position_loss: 2.5002
Epoch 19/1000

Epoch 00019: val_loss improved from 13.30643 to 13.27035, saving model to models/bc/shift2/max2016/simple-rnn/7.h5
 - 5s - loss: 12.9590 - out_stats_loss: 5.1522 - out_counts_loss: 2.1468 - out_mean_covariance_loss: 63.8121 - out_fielding_position_loss: 2.4693 - val_loss: 13.2703 - val_out_stats_loss: 5.3190 - val_out_counts_loss: 2.1777 - val_out_mean_covariance_loss: 65.4995 - val_out_fielding_position_loss: 2.4987
Epoch 20/1000

Epoch 00020: val_loss improved from 13.27035 to 13.22083, saving model to models/bc/shift2/max2016/simple-rnn/7.h5
 - 5s - loss: 12.9605 - out_stats_loss: 5.1551 - out_counts_loss: 2.1492 - out_mean_covariance_loss: 63.7981 - out_fielding_position_loss: 2.4664 - val_loss: 13.2208 - val_out_stats_loss: 5.3002 - val_out_counts_loss: 2.1695 - val_out_mean_covariance_loss: 65.3487 - val_out_fielding_position_loss: 2.4837
Epoch 21/1000

Epoch 00021: val_loss did not improve
 - 5s - loss: 12.8451 - out_stats_loss: 5.1183 - out_counts_loss: 2.1221 - out_mean_covariance_loss: 63.2071 - out_fielding_position_loss: 2.4444 - val_loss: 13.2792 - val_out_stats_loss: 5.3405 - val_out_counts_loss: 2.1939 - val_out_mean_covariance_loss: 65.3782 - val_out_fielding_position_loss: 2.4759
Epoch 22/1000

Epoch 00022: val_loss improved from 13.22083 to 13.18347, saving model to models/bc/shift2/max2016/simple-rnn/7.h5
 - 5s - loss: 12.8392 - out_stats_loss: 5.1198 - out_counts_loss: 2.1193 - out_mean_covariance_loss: 63.3525 - out_fielding_position_loss: 2.4325 - val_loss: 13.1835 - val_out_stats_loss: 5.2912 - val_out_counts_loss: 2.1703 - val_out_mean_covariance_loss: 65.0653 - val_out_fielding_position_loss: 2.4687
Epoch 23/1000

Epoch 00023: val_loss did not improve
 - 5s - loss: 12.8056 - out_stats_loss: 5.1127 - out_counts_loss: 2.1080 - out_mean_covariance_loss: 63.1109 - out_fielding_position_loss: 2.4293 - val_loss: 13.2207 - val_out_stats_loss: 5.3089 - val_out_counts_loss: 2.1908 - val_out_mean_covariance_loss: 65.1721 - val_out_fielding_position_loss: 2.4624
Epoch 24/1000

Epoch 00024: val_loss did not improve
 - 5s - loss: 12.7061 - out_stats_loss: 5.0717 - out_counts_loss: 2.0891 - out_mean_covariance_loss: 62.5080 - out_fielding_position_loss: 2.4199 - val_loss: 13.1914 - val_out_stats_loss: 5.2980 - val_out_counts_loss: 2.1837 - val_out_mean_covariance_loss: 65.0273 - val_out_fielding_position_loss: 2.4584
Epoch 25/1000

Epoch 00025: val_loss improved from 13.18347 to 13.12928, saving model to models/bc/shift2/max2016/simple-rnn/7.h5
 - 5s - loss: 12.6534 - out_stats_loss: 5.0633 - out_counts_loss: 2.0753 - out_mean_covariance_loss: 62.4628 - out_fielding_position_loss: 2.3917 - val_loss: 13.1293 - val_out_stats_loss: 5.2786 - val_out_counts_loss: 2.1637 - val_out_mean_covariance_loss: 64.7546 - val_out_fielding_position_loss: 2.4493
Epoch 26/1000

Epoch 00026: val_loss did not improve
 - 5s - loss: 12.6086 - out_stats_loss: 5.0577 - out_counts_loss: 2.0631 - out_mean_covariance_loss: 62.1307 - out_fielding_position_loss: 2.3812 - val_loss: 13.1335 - val_out_stats_loss: 5.2803 - val_out_counts_loss: 2.1678 - val_out_mean_covariance_loss: 64.8179 - val_out_fielding_position_loss: 2.4445
Epoch 27/1000

Epoch 00027: val_loss did not improve
 - 5s - loss: 12.5813 - out_stats_loss: 5.0563 - out_counts_loss: 2.0500 - out_mean_covariance_loss: 62.0584 - out_fielding_position_loss: 2.3721 - val_loss: 13.2805 - val_out_stats_loss: 5.3310 - val_out_counts_loss: 2.2528 - val_out_mean_covariance_loss: 65.1215 - val_out_fielding_position_loss: 2.4406
Epoch 28/1000

Epoch 00028: val_loss improved from 13.12928 to 13.11146, saving model to models/bc/shift2/max2016/simple-rnn/7.h5
 - 5s - loss: 12.5311 - out_stats_loss: 5.0275 - out_counts_loss: 2.0375 - out_mean_covariance_loss: 61.9727 - out_fielding_position_loss: 2.3676 - val_loss: 13.1115 - val_out_stats_loss: 5.2817 - val_out_counts_loss: 2.1684 - val_out_mean_covariance_loss: 64.5612 - val_out_fielding_position_loss: 2.4333
Epoch 29/1000

Epoch 00029: val_loss improved from 13.11146 to 13.10756, saving model to models/bc/shift2/max2016/simple-rnn/7.h5
 - 5s - loss: 12.5264 - out_stats_loss: 5.0437 - out_counts_loss: 2.0366 - out_mean_covariance_loss: 62.1187 - out_fielding_position_loss: 2.3402 - val_loss: 13.1076 - val_out_stats_loss: 5.2810 - val_out_counts_loss: 2.1713 - val_out_mean_covariance_loss: 64.5675 - val_out_fielding_position_loss: 2.4269
Epoch 30/1000

Epoch 00030: val_loss improved from 13.10756 to 13.10362, saving model to models/bc/shift2/max2016/simple-rnn/7.h5
 - 5s - loss: 12.5233 - out_stats_loss: 5.0356 - out_counts_loss: 2.0418 - out_mean_covariance_loss: 62.0054 - out_fielding_position_loss: 2.3457 - val_loss: 13.1036 - val_out_stats_loss: 5.2829 - val_out_counts_loss: 2.1726 - val_out_mean_covariance_loss: 64.4459 - val_out_fielding_position_loss: 2.4258
Epoch 31/1000

Epoch 00031: val_loss improved from 13.10362 to 13.06176, saving model to models/bc/shift2/max2016/simple-rnn/7.h5
 - 5s - loss: 12.4538 - out_stats_loss: 5.0161 - out_counts_loss: 2.0186 - out_mean_covariance_loss: 61.6597 - out_fielding_position_loss: 2.3361 - val_loss: 13.0618 - val_out_stats_loss: 5.2639 - val_out_counts_loss: 2.1632 - val_out_mean_covariance_loss: 64.3938 - val_out_fielding_position_loss: 2.4150
Epoch 32/1000

Epoch 00032: val_loss did not improve
 - 5s - loss: 12.4319 - out_stats_loss: 5.0062 - out_counts_loss: 2.0340 - out_mean_covariance_loss: 61.4787 - out_fielding_position_loss: 2.3178 - val_loss: 13.0668 - val_out_stats_loss: 5.2615 - val_out_counts_loss: 2.1773 - val_out_mean_covariance_loss: 64.3289 - val_out_fielding_position_loss: 2.4114
Epoch 33/1000

Epoch 00033: val_loss improved from 13.06176 to 13.05271, saving model to models/bc/shift2/max2016/simple-rnn/7.h5
 - 5s - loss: 12.3468 - out_stats_loss: 4.9748 - out_counts_loss: 2.0027 - out_mean_covariance_loss: 61.0815 - out_fielding_position_loss: 2.3153 - val_loss: 13.0527 - val_out_stats_loss: 5.2620 - val_out_counts_loss: 2.1742 - val_out_mean_covariance_loss: 64.1855 - val_out_fielding_position_loss: 2.4072
Epoch 34/1000

Epoch 00034: val_loss did not improve
 - 5s - loss: 12.3048 - out_stats_loss: 4.9762 - out_counts_loss: 1.9722 - out_mean_covariance_loss: 61.3449 - out_fielding_position_loss: 2.2891 - val_loss: 13.1547 - val_out_stats_loss: 5.2876 - val_out_counts_loss: 2.2359 - val_out_mean_covariance_loss: 64.4497 - val_out_fielding_position_loss: 2.4087
Epoch 35/1000

Epoch 00035: val_loss did not improve
 - 5s - loss: 12.3729 - out_stats_loss: 5.0131 - out_counts_loss: 1.9711 - out_mean_covariance_loss: 61.9132 - out_fielding_position_loss: 2.2931 - val_loss: 13.1619 - val_out_stats_loss: 5.3029 - val_out_counts_loss: 2.2347 - val_out_mean_covariance_loss: 64.3935 - val_out_fielding_position_loss: 2.4047
Epoch 36/1000

Epoch 00036: val_loss did not improve
 - 5s - loss: 12.2720 - out_stats_loss: 4.9760 - out_counts_loss: 1.9680 - out_mean_covariance_loss: 60.8413 - out_fielding_position_loss: 2.2860 - val_loss: 13.1653 - val_out_stats_loss: 5.3015 - val_out_counts_loss: 2.2419 - val_out_mean_covariance_loss: 64.4349 - val_out_fielding_position_loss: 2.4001
Epoch 37/1000

Epoch 00037: val_loss did not improve
 - 5s - loss: 12.2161 - out_stats_loss: 4.9680 - out_counts_loss: 1.9455 - out_mean_covariance_loss: 60.8439 - out_fielding_position_loss: 2.2605 - val_loss: 13.0561 - val_out_stats_loss: 5.2701 - val_out_counts_loss: 2.1834 - val_out_mean_covariance_loss: 64.1540 - val_out_fielding_position_loss: 2.3950
Epoch 38/1000

Epoch 00038: val_loss did not improve
 - 5s - loss: 12.1534 - out_stats_loss: 4.9365 - out_counts_loss: 1.9301 - out_mean_covariance_loss: 60.6672 - out_fielding_position_loss: 2.2535 - val_loss: 13.0693 - val_out_stats_loss: 5.2823 - val_out_counts_loss: 2.1932 - val_out_mean_covariance_loss: 64.1913 - val_out_fielding_position_loss: 2.3842
Epoch 39/1000

Epoch 00039: val_loss did not improve
 - 5s - loss: 12.1674 - out_stats_loss: 4.9552 - out_counts_loss: 1.9233 - out_mean_covariance_loss: 60.6432 - out_fielding_position_loss: 2.2567 - val_loss: 13.0850 - val_out_stats_loss: 5.2816 - val_out_counts_loss: 2.2058 - val_out_mean_covariance_loss: 64.2446 - val_out_fielding_position_loss: 2.3854
Epoch 40/1000

Epoch 00040: val_loss improved from 13.05271 to 13.00928, saving model to models/bc/shift2/max2016/simple-rnn/7.h5
 - 5s - loss: 12.1429 - out_stats_loss: 4.9411 - out_counts_loss: 1.9270 - out_mean_covariance_loss: 60.6505 - out_fielding_position_loss: 2.2422 - val_loss: 13.0093 - val_out_stats_loss: 5.2573 - val_out_counts_loss: 2.1816 - val_out_mean_covariance_loss: 63.9614 - val_out_fielding_position_loss: 2.3724
Epoch 41/1000

Epoch 00041: val_loss did not improve
 - 5s - loss: 12.0377 - out_stats_loss: 4.9031 - out_counts_loss: 1.9001 - out_mean_covariance_loss: 60.0326 - out_fielding_position_loss: 2.2328 - val_loss: 13.0578 - val_out_stats_loss: 5.2692 - val_out_counts_loss: 2.2114 - val_out_mean_covariance_loss: 64.1142 - val_out_fielding_position_loss: 2.3714
Epoch 42/1000

Epoch 00042: val_loss did not improve
 - 5s - loss: 12.0240 - out_stats_loss: 4.9202 - out_counts_loss: 1.8727 - out_mean_covariance_loss: 60.2118 - out_fielding_position_loss: 2.2205 - val_loss: 13.0741 - val_out_stats_loss: 5.2926 - val_out_counts_loss: 2.2083 - val_out_mean_covariance_loss: 64.0694 - val_out_fielding_position_loss: 2.3697
Epoch 43/1000

Epoch 00043: val_loss did not improve
 - 5s - loss: 11.9500 - out_stats_loss: 4.8911 - out_counts_loss: 1.8682 - out_mean_covariance_loss: 59.8148 - out_fielding_position_loss: 2.1999 - val_loss: 13.0539 - val_out_stats_loss: 5.2794 - val_out_counts_loss: 2.2115 - val_out_mean_covariance_loss: 64.0250 - val_out_fielding_position_loss: 2.3618
Epoch 44/1000

Epoch 00044: val_loss did not improve
 - 5s - loss: 12.0785 - out_stats_loss: 4.9440 - out_counts_loss: 1.8925 - out_mean_covariance_loss: 60.4582 - out_fielding_position_loss: 2.2190 - val_loss: 13.0346 - val_out_stats_loss: 5.2681 - val_out_counts_loss: 2.2017 - val_out_mean_covariance_loss: 63.9325 - val_out_fielding_position_loss: 2.3682
Epoch 45/1000

Epoch 00045: val_loss did not improve
 - 5s - loss: 11.9178 - out_stats_loss: 4.8967 - out_counts_loss: 1.8524 - out_mean_covariance_loss: 59.9014 - out_fielding_position_loss: 2.1736 - val_loss: 13.0304 - val_out_stats_loss: 5.2617 - val_out_counts_loss: 2.2197 - val_out_mean_covariance_loss: 63.9457 - val_out_fielding_position_loss: 2.3517
Epoch 46/1000

Epoch 00046: val_loss did not improve
 - 5s - loss: 11.8461 - out_stats_loss: 4.8637 - out_counts_loss: 1.8529 - out_mean_covariance_loss: 59.3333 - out_fielding_position_loss: 2.1628 - val_loss: 13.0387 - val_out_stats_loss: 5.2668 - val_out_counts_loss: 2.2268 - val_out_mean_covariance_loss: 63.9432 - val_out_fielding_position_loss: 2.3479
Epoch 47/1000

Epoch 00047: val_loss did not improve
 - 5s - loss: 11.7995 - out_stats_loss: 4.8638 - out_counts_loss: 1.8274 - out_mean_covariance_loss: 59.2915 - out_fielding_position_loss: 2.1436 - val_loss: 13.0149 - val_out_stats_loss: 5.2651 - val_out_counts_loss: 2.2164 - val_out_mean_covariance_loss: 63.7757 - val_out_fielding_position_loss: 2.3447
Epoch 48/1000

Epoch 00048: val_loss did not improve
 - 5s - loss: 11.8180 - out_stats_loss: 4.8754 - out_counts_loss: 1.8339 - out_mean_covariance_loss: 59.2869 - out_fielding_position_loss: 2.1444 - val_loss: 13.0229 - val_out_stats_loss: 5.2633 - val_out_counts_loss: 2.2245 - val_out_mean_covariance_loss: 63.8228 - val_out_fielding_position_loss: 2.3439
Epoch 49/1000

Epoch 00049: val_loss did not improve
 - 5s - loss: 11.7720 - out_stats_loss: 4.8573 - out_counts_loss: 1.8149 - out_mean_covariance_loss: 59.1452 - out_fielding_position_loss: 2.1425 - val_loss: 13.0758 - val_out_stats_loss: 5.2927 - val_out_counts_loss: 2.2397 - val_out_mean_covariance_loss: 63.8269 - val_out_fielding_position_loss: 2.3520
Epoch 50/1000

Epoch 00050: val_loss did not improve
 - 5s - loss: 11.7382 - out_stats_loss: 4.8471 - out_counts_loss: 1.8182 - out_mean_covariance_loss: 58.9575 - out_fielding_position_loss: 2.1250 - val_loss: 13.1138 - val_out_stats_loss: 5.3061 - val_out_counts_loss: 2.2739 - val_out_mean_covariance_loss: 63.7696 - val_out_fielding_position_loss: 2.3453
Epoch 51/1000

Epoch 00051: val_loss did not improve
 - 5s - loss: 11.7525 - out_stats_loss: 4.8570 - out_counts_loss: 1.8094 - out_mean_covariance_loss: 59.1318 - out_fielding_position_loss: 2.1296 - val_loss: 13.0465 - val_out_stats_loss: 5.2815 - val_out_counts_loss: 2.2424 - val_out_mean_covariance_loss: 63.6829 - val_out_fielding_position_loss: 2.3385
Epoch 52/1000

Epoch 00052: val_loss did not improve
 - 5s - loss: 11.6356 - out_stats_loss: 4.8109 - out_counts_loss: 1.7940 - out_mean_covariance_loss: 58.3903 - out_fielding_position_loss: 2.1111 - val_loss: 13.0186 - val_out_stats_loss: 5.2620 - val_out_counts_loss: 2.2378 - val_out_mean_covariance_loss: 63.7522 - val_out_fielding_position_loss: 2.3313
Epoch 53/1000

Epoch 00053: val_loss did not improve
 - 5s - loss: 11.6635 - out_stats_loss: 4.8385 - out_counts_loss: 1.7837 - out_mean_covariance_loss: 58.7405 - out_fielding_position_loss: 2.1043 - val_loss: 13.0742 - val_out_stats_loss: 5.2792 - val_out_counts_loss: 2.2679 - val_out_mean_covariance_loss: 63.7071 - val_out_fielding_position_loss: 2.3417
Epoch 54/1000

Epoch 00054: val_loss did not improve
 - 5s - loss: 11.6110 - out_stats_loss: 4.8152 - out_counts_loss: 1.7822 - out_mean_covariance_loss: 58.6081 - out_fielding_position_loss: 2.0833 - val_loss: 13.1976 - val_out_stats_loss: 5.3234 - val_out_counts_loss: 2.3311 - val_out_mean_covariance_loss: 64.1296 - val_out_fielding_position_loss: 2.3367
Epoch 55/1000

Epoch 00055: val_loss did not improve
 - 5s - loss: 11.6356 - out_stats_loss: 4.8358 - out_counts_loss: 1.7824 - out_mean_covariance_loss: 58.7124 - out_fielding_position_loss: 2.0819 - val_loss: 13.0381 - val_out_stats_loss: 5.2742 - val_out_counts_loss: 2.2534 - val_out_mean_covariance_loss: 63.7514 - val_out_fielding_position_loss: 2.3229
Epoch 56/1000

Epoch 00056: val_loss did not improve
 - 5s - loss: 11.5021 - out_stats_loss: 4.7824 - out_counts_loss: 1.7519 - out_mean_covariance_loss: 58.1375 - out_fielding_position_loss: 2.0609 - val_loss: 13.0417 - val_out_stats_loss: 5.2705 - val_out_counts_loss: 2.2641 - val_out_mean_covariance_loss: 63.7887 - val_out_fielding_position_loss: 2.3177
Epoch 57/1000

Epoch 00057: val_loss did not improve
 - 5s - loss: 11.5235 - out_stats_loss: 4.8024 - out_counts_loss: 1.7497 - out_mean_covariance_loss: 58.3137 - out_fielding_position_loss: 2.0557 - val_loss: 13.2464 - val_out_stats_loss: 5.3517 - val_out_counts_loss: 2.3576 - val_out_mean_covariance_loss: 64.0425 - val_out_fielding_position_loss: 2.3349
Epoch 58/1000

Epoch 00058: val_loss did not improve
 - 5s - loss: 11.5157 - out_stats_loss: 4.7951 - out_counts_loss: 1.7503 - out_mean_covariance_loss: 58.0514 - out_fielding_position_loss: 2.0677 - val_loss: 13.1209 - val_out_stats_loss: 5.3118 - val_out_counts_loss: 2.3043 - val_out_mean_covariance_loss: 63.7967 - val_out_fielding_position_loss: 2.3149
Epoch 59/1000

Epoch 00059: val_loss did not improve
 - 5s - loss: 11.5137 - out_stats_loss: 4.8083 - out_counts_loss: 1.7422 - out_mean_covariance_loss: 58.2380 - out_fielding_position_loss: 2.0513 - val_loss: 13.0443 - val_out_stats_loss: 5.2814 - val_out_counts_loss: 2.2722 - val_out_mean_covariance_loss: 63.6220 - val_out_fielding_position_loss: 2.3095
Epoch 60/1000

Epoch 00060: val_loss did not improve
 - 5s - loss: 11.4273 - out_stats_loss: 4.7696 - out_counts_loss: 1.7304 - out_mean_covariance_loss: 57.7297 - out_fielding_position_loss: 2.0409 - val_loss: 13.0394 - val_out_stats_loss: 5.2754 - val_out_counts_loss: 2.2809 - val_out_mean_covariance_loss: 63.5850 - val_out_fielding_position_loss: 2.3039
Epoch 61/1000

Epoch 00061: val_loss did not improve
 - 5s - loss: 11.4138 - out_stats_loss: 4.7787 - out_counts_loss: 1.7234 - out_mean_covariance_loss: 57.7010 - out_fielding_position_loss: 2.0266 - val_loss: 13.1205 - val_out_stats_loss: 5.3149 - val_out_counts_loss: 2.3113 - val_out_mean_covariance_loss: 63.6802 - val_out_fielding_position_loss: 2.3102
Epoch 62/1000

Epoch 00062: val_loss did not improve
 - 5s - loss: 11.4857 - out_stats_loss: 4.8083 - out_counts_loss: 1.7350 - out_mean_covariance_loss: 58.2688 - out_fielding_position_loss: 2.0290 - val_loss: 13.1298 - val_out_stats_loss: 5.3045 - val_out_counts_loss: 2.3228 - val_out_mean_covariance_loss: 63.7278 - val_out_fielding_position_loss: 2.3160
Epoch 63/1000

Epoch 00063: val_loss did not improve
 - 5s - loss: 11.3908 - out_stats_loss: 4.7757 - out_counts_loss: 1.7014 - out_mean_covariance_loss: 57.9073 - out_fielding_position_loss: 2.0183 - val_loss: 13.1807 - val_out_stats_loss: 5.3296 - val_out_counts_loss: 2.3410 - val_out_mean_covariance_loss: 63.8673 - val_out_fielding_position_loss: 2.3167
Epoch 64/1000

Epoch 00064: val_loss did not improve
 - 5s - loss: 11.4019 - out_stats_loss: 4.7890 - out_counts_loss: 1.6969 - out_mean_covariance_loss: 58.1501 - out_fielding_position_loss: 2.0085 - val_loss: 13.0619 - val_out_stats_loss: 5.2786 - val_out_counts_loss: 2.3065 - val_out_mean_covariance_loss: 63.6496 - val_out_fielding_position_loss: 2.2943
Epoch 65/1000

Epoch 00065: val_loss did not improve
 - 5s - loss: 11.3478 - out_stats_loss: 4.7685 - out_counts_loss: 1.6884 - out_mean_covariance_loss: 57.8269 - out_fielding_position_loss: 1.9995 - val_loss: 13.1472 - val_out_stats_loss: 5.3085 - val_out_counts_loss: 2.3539 - val_out_mean_covariance_loss: 63.7095 - val_out_fielding_position_loss: 2.2993
Epoch 66/1000

Epoch 00066: val_loss did not improve
 - 5s - loss: 11.2725 - out_stats_loss: 4.7307 - out_counts_loss: 1.6911 - out_mean_covariance_loss: 57.2692 - out_fielding_position_loss: 1.9872 - val_loss: 13.1978 - val_out_stats_loss: 5.3193 - val_out_counts_loss: 2.3774 - val_out_mean_covariance_loss: 63.8946 - val_out_fielding_position_loss: 2.3065
Epoch 67/1000

Epoch 00067: val_loss did not improve
 - 5s - loss: 11.3217 - out_stats_loss: 4.7609 - out_counts_loss: 1.7028 - out_mean_covariance_loss: 57.5903 - out_fielding_position_loss: 1.9785 - val_loss: 13.1392 - val_out_stats_loss: 5.3098 - val_out_counts_loss: 2.3407 - val_out_mean_covariance_loss: 63.7371 - val_out_fielding_position_loss: 2.3019
Epoch 68/1000

Epoch 00068: val_loss did not improve
 - 5s - loss: 11.2728 - out_stats_loss: 4.7585 - out_counts_loss: 1.6730 - out_mean_covariance_loss: 57.5347 - out_fielding_position_loss: 1.9646 - val_loss: 13.0782 - val_out_stats_loss: 5.2876 - val_out_counts_loss: 2.3131 - val_out_mean_covariance_loss: 63.6590 - val_out_fielding_position_loss: 2.2945
Epoch 69/1000

Epoch 00069: val_loss did not improve
 - 5s - loss: 11.2061 - out_stats_loss: 4.7260 - out_counts_loss: 1.6758 - out_mean_covariance_loss: 56.9126 - out_fielding_position_loss: 1.9587 - val_loss: 13.1639 - val_out_stats_loss: 5.3318 - val_out_counts_loss: 2.3515 - val_out_mean_covariance_loss: 63.8103 - val_out_fielding_position_loss: 2.2900
Epoch 70/1000

Epoch 00070: val_loss did not improve
 - 5s - loss: 11.1895 - out_stats_loss: 4.7200 - out_counts_loss: 1.6682 - out_mean_covariance_loss: 56.7671 - out_fielding_position_loss: 1.9629 - val_loss: 13.0570 - val_out_stats_loss: 5.2879 - val_out_counts_loss: 2.3133 - val_out_mean_covariance_loss: 63.4788 - val_out_fielding_position_loss: 2.2820
Epoch 71/1000

Epoch 00071: val_loss did not improve
 - 5s - loss: 11.1911 - out_stats_loss: 4.7264 - out_counts_loss: 1.6617 - out_mean_covariance_loss: 56.9645 - out_fielding_position_loss: 1.9548 - val_loss: 13.1748 - val_out_stats_loss: 5.3332 - val_out_counts_loss: 2.3684 - val_out_mean_covariance_loss: 63.6624 - val_out_fielding_position_loss: 2.2901
Epoch 72/1000

Epoch 00072: val_loss did not improve
 - 5s - loss: 11.1172 - out_stats_loss: 4.7021 - out_counts_loss: 1.6484 - out_mean_covariance_loss: 56.4816 - out_fielding_position_loss: 1.9427 - val_loss: 13.1808 - val_out_stats_loss: 5.3363 - val_out_counts_loss: 2.3769 - val_out_mean_covariance_loss: 63.8058 - val_out_fielding_position_loss: 2.2773
Epoch 73/1000

Epoch 00073: val_loss did not improve
 - 5s - loss: 11.1038 - out_stats_loss: 4.7139 - out_counts_loss: 1.6333 - out_mean_covariance_loss: 56.7206 - out_fielding_position_loss: 1.9206 - val_loss: 13.0914 - val_out_stats_loss: 5.2897 - val_out_counts_loss: 2.3449 - val_out_mean_covariance_loss: 63.4652 - val_out_fielding_position_loss: 2.2835
Epoch 74/1000

Epoch 00074: val_loss did not improve
 - 5s - loss: 11.1118 - out_stats_loss: 4.7197 - out_counts_loss: 1.6192 - out_mean_covariance_loss: 57.0108 - out_fielding_position_loss: 1.9224 - val_loss: 13.1470 - val_out_stats_loss: 5.3299 - val_out_counts_loss: 2.3494 - val_out_mean_covariance_loss: 63.6586 - val_out_fielding_position_loss: 2.2847
Epoch 75/1000

Epoch 00075: val_loss did not improve
 - 5s - loss: 11.0701 - out_stats_loss: 4.6991 - out_counts_loss: 1.6278 - out_mean_covariance_loss: 56.5097 - out_fielding_position_loss: 1.9177 - val_loss: 13.1007 - val_out_stats_loss: 5.2981 - val_out_counts_loss: 2.3544 - val_out_mean_covariance_loss: 63.5297 - val_out_fielding_position_loss: 2.2717
Epoch 76/1000

Epoch 00076: val_loss did not improve
 - 5s - loss: 11.0452 - out_stats_loss: 4.6981 - out_counts_loss: 1.6207 - out_mean_covariance_loss: 56.2875 - out_fielding_position_loss: 1.9120 - val_loss: 13.1768 - val_out_stats_loss: 5.3385 - val_out_counts_loss: 2.3839 - val_out_mean_covariance_loss: 63.6364 - val_out_fielding_position_loss: 2.2726
Epoch 77/1000

Epoch 00077: val_loss did not improve
 - 5s - loss: 11.0666 - out_stats_loss: 4.6957 - out_counts_loss: 1.6314 - out_mean_covariance_loss: 56.4024 - out_fielding_position_loss: 1.9195 - val_loss: 13.1410 - val_out_stats_loss: 5.3115 - val_out_counts_loss: 2.3728 - val_out_mean_covariance_loss: 63.6010 - val_out_fielding_position_loss: 2.2766
Epoch 78/1000

Epoch 00078: val_loss did not improve
 - 5s - loss: 11.0443 - out_stats_loss: 4.6968 - out_counts_loss: 1.6154 - out_mean_covariance_loss: 56.5121 - out_fielding_position_loss: 1.9065 - val_loss: 13.2226 - val_out_stats_loss: 5.3240 - val_out_counts_loss: 2.4179 - val_out_mean_covariance_loss: 63.6828 - val_out_fielding_position_loss: 2.2965
Epoch 79/1000

Epoch 00079: val_loss did not improve
 - 5s - loss: 11.0088 - out_stats_loss: 4.6893 - out_counts_loss: 1.6113 - out_mean_covariance_loss: 56.4721 - out_fielding_position_loss: 1.8847 - val_loss: 13.1122 - val_out_stats_loss: 5.2969 - val_out_counts_loss: 2.3688 - val_out_mean_covariance_loss: 63.6411 - val_out_fielding_position_loss: 2.2644
Epoch 80/1000

Epoch 00080: val_loss did not improve
 - 5s - loss: 10.9843 - out_stats_loss: 4.6825 - out_counts_loss: 1.5955 - out_mean_covariance_loss: 56.4359 - out_fielding_position_loss: 1.8844 - val_loss: 13.1583 - val_out_stats_loss: 5.3174 - val_out_counts_loss: 2.3957 - val_out_mean_covariance_loss: 63.6114 - val_out_fielding_position_loss: 2.2647
Epoch 81/1000

Epoch 00081: val_loss did not improve
 - 5s - loss: 10.9331 - out_stats_loss: 4.6701 - out_counts_loss: 1.5963 - out_mean_covariance_loss: 55.7782 - out_fielding_position_loss: 1.8777 - val_loss: 13.1147 - val_out_stats_loss: 5.2980 - val_out_counts_loss: 2.3776 - val_out_mean_covariance_loss: 63.5545 - val_out_fielding_position_loss: 2.2613
Epoch 82/1000

Epoch 00082: val_loss did not improve
 - 5s - loss: 10.8837 - out_stats_loss: 4.6527 - out_counts_loss: 1.5814 - out_mean_covariance_loss: 55.6426 - out_fielding_position_loss: 1.8675 - val_loss: 13.1648 - val_out_stats_loss: 5.3098 - val_out_counts_loss: 2.4000 - val_out_mean_covariance_loss: 63.6004 - val_out_fielding_position_loss: 2.2750
Epoch 83/1000

Epoch 00083: val_loss did not improve
 - 5s - loss: 10.8479 - out_stats_loss: 4.6331 - out_counts_loss: 1.5841 - out_mean_covariance_loss: 55.3366 - out_fielding_position_loss: 1.8639 - val_loss: 13.1408 - val_out_stats_loss: 5.2984 - val_out_counts_loss: 2.3871 - val_out_mean_covariance_loss: 63.6860 - val_out_fielding_position_loss: 2.2711
Epoch 84/1000

Epoch 00084: val_loss did not improve
 - 5s - loss: 10.8552 - out_stats_loss: 4.6435 - out_counts_loss: 1.5659 - out_mean_covariance_loss: 55.6655 - out_fielding_position_loss: 1.8625 - val_loss: 13.2528 - val_out_stats_loss: 5.3565 - val_out_counts_loss: 2.4345 - val_out_mean_covariance_loss: 63.8627 - val_out_fielding_position_loss: 2.2687
Epoch 85/1000

Epoch 00085: val_loss did not improve
 - 5s - loss: 10.8355 - out_stats_loss: 4.6477 - out_counts_loss: 1.5663 - out_mean_covariance_loss: 55.5170 - out_fielding_position_loss: 1.8456 - val_loss: 13.2077 - val_out_stats_loss: 5.3232 - val_out_counts_loss: 2.4329 - val_out_mean_covariance_loss: 63.7386 - val_out_fielding_position_loss: 2.2646
Epoch 86/1000

Epoch 00086: val_loss did not improve
 - 5s - loss: 10.7791 - out_stats_loss: 4.6212 - out_counts_loss: 1.5615 - out_mean_covariance_loss: 55.2868 - out_fielding_position_loss: 1.8320 - val_loss: 13.1472 - val_out_stats_loss: 5.3115 - val_out_counts_loss: 2.3976 - val_out_mean_covariance_loss: 63.5000 - val_out_fielding_position_loss: 2.2632
Epoch 87/1000

Epoch 00087: val_loss did not improve
 - 5s - loss: 10.8065 - out_stats_loss: 4.6402 - out_counts_loss: 1.5610 - out_mean_covariance_loss: 55.4773 - out_fielding_position_loss: 1.8315 - val_loss: 13.1591 - val_out_stats_loss: 5.3095 - val_out_counts_loss: 2.4017 - val_out_mean_covariance_loss: 63.7129 - val_out_fielding_position_loss: 2.2622
Epoch 88/1000

Epoch 00088: val_loss did not improve
 - 5s - loss: 10.7710 - out_stats_loss: 4.6222 - out_counts_loss: 1.5602 - out_mean_covariance_loss: 55.1672 - out_fielding_position_loss: 1.8302 - val_loss: 13.2289 - val_out_stats_loss: 5.3450 - val_out_counts_loss: 2.4334 - val_out_mean_covariance_loss: 63.7454 - val_out_fielding_position_loss: 2.2632
Epoch 89/1000

Epoch 00089: val_loss did not improve
 - 5s - loss: 10.8031 - out_stats_loss: 4.6386 - out_counts_loss: 1.5517 - out_mean_covariance_loss: 55.4257 - out_fielding_position_loss: 1.8415 - val_loss: 13.2091 - val_out_stats_loss: 5.3330 - val_out_counts_loss: 2.4363 - val_out_mean_covariance_loss: 63.5023 - val_out_fielding_position_loss: 2.2647
Epoch 90/1000

Epoch 00090: val_loss did not improve
 - 5s - loss: 10.7232 - out_stats_loss: 4.6146 - out_counts_loss: 1.5416 - out_mean_covariance_loss: 55.1057 - out_fielding_position_loss: 1.8117 - val_loss: 13.1067 - val_out_stats_loss: 5.3009 - val_out_counts_loss: 2.3871 - val_out_mean_covariance_loss: 63.5186 - val_out_fielding_position_loss: 2.2428
/usr/local/lib/python3.5/dist-packages/h5py/__init__.py:36: FutureWarning: Conversion of the second argument of issubdtype from `float` to `np.floating` is deprecated. In future, it will be treated as `np.float64 == np.dtype(float).type`.
  from ._conv import register_converters as _register_converters
Using TensorFlow backend.
Years: [1958,2016]
Shift: 2
Fold: 4
Training into models/bc/shift2/max2016/simple-rnn/7.h5
/usr/local/lib/python3.5/dist-packages/keras/legacy/layers.py:533: UserWarning: The `MaxoutDense` layer is deprecated and will be removed after 06/2017.
  warnings.warn('The `MaxoutDense` layer is deprecated '
